{
  "subjectName": "ミトコンドリア学特論",
  "instructors": [
    "岡本瑞穂(応用生物学部応用生物学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGB14301",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "水",
      "period": 1
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程バイオニクス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ４０２",
  "lastUpdated": "2025/03/12",
  "overview": "ミトコンドリアは細胞内のエネルギー産生やアポトーシスを司る重要な細胞内小器官である。本講義では、「生化学」、「分子生物学」の知識をベースに、エネルギー産生の基本的な流れやアポトーシス、ミトコンドリアの役割、制御、進化の過程、測定手法の原理について学ぶ。さらに文献調査では、ミトコンドリアを中心とした最新のトピックスについても議論し、細胞内小器官に関する理解を深める。 Mitochondria are essential organelles responsible for cellular energy production and apoptosis. This course builds upon fundamental knowledge of Biochemistry and Molecular Biology to explore the basic mechanisms of energy production, apoptosis, mitochondrial functions, regulation, evolution, and measurement techniques. Additionally, through literature review and discussion, students will engage with recent research topics centered on mitochondria, deepening their understanding of intracellular organelles.",
  "objectives": "本講義では、ミトコンドリアについての「実学に基づく専門能力」を身につけることを目指す。また、英語論文や英語のミトコンドリア解説動画を紹介し、「国際的な教養」を身につける。そして、ミトコンドリアの測定手法の原理について学ぶことで、「論理的な思考力の向上」を図る。さらに、最新のミトコンドリア研究の課題について議論し「問題解決力」を培う。 This course aims to develop specialized expertise in mitochondria based on applied biological sciences. Students will be introduced to English research papers and explanatory videos to enhance their global literacy and understanding of international scientific literature. By learning the principles of mitochondrial measurement techniques, students will improve their logical thinking and analytical skills. Furthermore, discussions on the latest challenges in mitochondrial research will foster problem-solving abilities, enabling students to address key scientific issues.",
  "teachingMethod": "パワーポイントの資料を中心に、講義を行う。また、講義中に動画視聴などを行うため、ノートPCは必携 The lecture will be conducted primarily using PowerPoint presentations. Additionally, as video viewing and other activities will be included during the lecture, a laptop is required.",
  "notes": "分子生物学、生化学を理解して本講義に臨むこと Students are expected to have a fundamental understanding of molecular biology and biochemistry before attending this course.",
  "preparation": "各授業は、分子生物学、生化学の復習から行われる。したがって、各授業前に提示した資料を良く読み、わからない部分を理解しておくこと。（予習60 分） Each lecture will begin with a review of molecular biology and biochemistry. Therefore, students are required to thoroughly read the provided materials before each class and clarify any unclear points in advance. (Preparation time: 60 minutes)",
  "evaluation": "講義出席を前提とし、講義中の質疑応答・課題（40％）、全講義終了後の提出課題（60％）で評価する。合計点を100点とし、60点以上で単位認定とする。各講義終了後にアンケートを行い、学習状況に対するフィードバックを行う。 Attendance is mandatory. Evaluation consists of class participation and assignments (40%) and a final assignment (60%). A total score of 100 points, with 60 or higher required to pass. Surveys will provide feedback on learning progress.",
  "textbook": "無し None",
  "referenceMaterials": "細胞の分子生物学 第6版 Bruce Alberts, Alexander Johnson, Julian Lewis, David Morgan, Martin Raff, Keith Roberts, Peter Walter 著ほか ニュートンプレス 新ミトコンドリア学 内海耕慥、井上正康 著 共立出版 Essential細胞生物学原書第5版 中村桂子/松原謙一/榊佳之/水島昇 監修、南江堂",
  "schedulePlan": "第1回:ミトコンドリアの歴史 第2回:ミトコンドリア電子伝達系と酸化的リン酸化 第3回:ミトコンドリアとアポトーシス 第4回:ミトコンドリアDNAの複製・転写・翻訳・分解 第5回:ミトコンドリア活性酸素とミトコンドリア病 第6回:ミトコンドリア機能の測定 第7回:ミトコンドリアと様々な細胞内小器官の相互作用 Course Schedule: Week 1: History of Mitochondria Week 2: Mitochondrial Electron Transport Chain and Oxidative Phosphorylation Week 3: Mitochondria and Apoptosis Week 4: Mitochondrial DNA Replication, Transcription, Translation, and Degradation Week 5: Mitochondrial Reactive Oxygen Species and Mitochondrial Diseases Week 6: Measurement of Mitochondrial Function Week 7: Interactions Between Mitochondria and Other Intracellular Organelles"
}