{
  "subjectName": "皮膚科学特論",
  "instructors": [
    "松井毅(応用生物学部応用生物学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGB13001",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "金",
      "period": 1
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程バイオニクス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ３０２",
  "lastUpdated": "2025/03/21",
  "overview": "皮膚科学研究やその皮膚疾患に対する創薬・化粧品関連業務に携わる上で、必須の美容の基礎知識と最新の科学的知見を習得することを目的とした実践的科目として開講する。皮膚の基本的な構造と役割・機能、皮膚の発生と進化的起源、皮膚の恒常性異常から発生する様々な疾患や変化について解説する。特に、化粧品開発に必要とされる皮膚の保湿や老化による形態の変化、疾病に関係する皮膚内部で起きる現象を分子機構も含めて詳細に解説し、皮膚表面に現れてくる変化や症状との因果関係について解説する。皮膚科学関連の最新論文も紹介し、研究背景やデータの解釈、今後の研究の方向性や発展性、産業への応用性に関して、考察を行う。 This practical course is designed to provide essential foundational knowledge in dermatology and the latest scientific insights necessary for research in dermatological sciences. The course covers the basic structure, roles, and functions of the skin, its embryonic development and evolutionary origins, and various diseases and changes arising from skin homeostasis disorders.",
  "objectives": "本講義では、皮膚科学の基礎知識を高度なレベルで習得しつつ、最新の皮膚科学研究の知見も積極的にとりこみ、創薬や化粧品開発などの実学に基づく専門能力を身に付けることを目指す。皮膚の基本的な構造、機能および年齢による変化、外的因子により誘導される変化とその変化を誘導する作用機序について深く理解する。加えて世界で行われている最新の皮膚科学分野の研究テーマを理解できる論理的な思考力、そこから、何が未解明となっている皮膚科学研究テーマであるかを把握する。さらには、それらの知見から、創薬や化粧品開発などの産業応用可能なコンセプトの立案ができるような問題解決力を習得することを達成目標とする。 This course aims to provide students with an advanced understanding of fundamental dermatological science while integrating the latest findings in dermatological research. Through this, students will develop specialized skills applicable to practical fields such as drug discovery and cosmetic development.",
  "teachingMethod": "パワーポイント資料、配布プリント、板書を併用して授業を行う。 ノートPCまたはスマートフォンは、出席管理や授業中の双方向コミュニケーションに用いるため、必携です。また講義資料は授業開始前にMoodleに掲載しますので、事前の予習、講義中の資料の補助、講義後の復習に活用してください。 The lectures will primarily be conducted using PowerPoint presentations. Students are required to bring a laptop or smartphone, as these devices will be used for attendance management and interactive communication during the class. Lecture materials will be uploaded to Moodle before each session, allowing students to use them for pre-class preparation, in-class reference, and post-class review.",
  "notes": "細胞生物学の基礎知識を履修にあたり復習しておくこと。 Students are expected to review fundamental concepts of cell biology before taking this course.",
  "preparation": "毎回の授業前において全体の内容を含むプリントをMoodleで公開するので、教科書と参考教科書（資料）と共に予習をしておくこと。復習は、講義資料やMoodleに紹介した参考資料を勉強することが望ましい。 Before each class, a comprehensive handout covering the lecture content will be made available on Moodle. Students are expected to prepare by studying the handout along with the textbook and reference materials. For review, it is recommended that students study the lecture materials and additional references provided on Moodle.",
  "evaluation": "最終回の講義終了後に提示されるレポート課題で評価する。 Evaluation will be based on a report assignment, which will be given after the final lecture.",
  "textbook": "配布する講義資料 Lecture materials will be distributed via Moodle.",
  "referenceMaterials": "・あたらしい皮膚科学（清水宏著：中山書店） ・あたらしい美容皮膚科学（南山堂） ・化粧品の効能を考える時に読む皮膚科学（正木仁著：技術教育出版社） ・エビデンスに基づくアトピー性皮膚炎治療 新しい潮流（編集 椛島健治/宮地良樹：中山書店）",
  "schedulePlan": "第1回：皮膚科学の総論-皮膚の構造、付属器官- 第2回：表皮の分化 第3回：角層形成プロセス-その1-特殊な細胞死、コルネオトーシス 第4回：角層形成プロセス-その2-角層バリア形成 第5回：フィラグリンと角層バリア 第6回：タイトジャンクションと表皮ターンオーバー 第7回：外部講師による皮膚科学や化粧品開発についての講演"
}