{
  "subjectName": "環境マネジメント特論",
  "instructors": [
    "浦瀬太郎(応用生物学部応用生物学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGB11601",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "金",
      "period": 1
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程バイオニクス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ２０３",
  "lastUpdated": "2025/01/06",
  "overview": "さまざまな微量化学物質による汚染や放射線，有害微生物によるリスクをどのように管理するのかについての基本的な考え方をこの授業では学ぶ。さらに，水環境関連技術の最新の動向についても学ぶ。これらの学びにより，環境工学分野のみならず，他の生物工学や生命科学の分野の学生に対しても，地球規模の思考のできる力を育成する。 This class teaches fundamental approaches to managing environmental risks, such as contamination from various trace chemicals and pathogenic microorganisms. This course also teaches the latest technologies in water and wastewater treatment. The course encourages students to develop global thinking, not only in the field of environmental engineering but also in bioscience and biotechnology.",
  "objectives": "環境分野における実学に基づく専門力をつける。生物工学や生命科学の分野の学生全員が身に付けてほしい環境問題への対応力をはぐくみ，さらに環境部門で働く場合に必要となる基礎知識の獲得とを目指す。また，基準値，環境規制に関するレポートを作成することで，予算や人的資源に制約のある中で，どの価値を優先すべきかについて判断基準を学ぶ(問題解決力)。また，英語の有害物データベースを参照することで化学物質の毒性情報を英語で確認することができるようになることを目指す(国際的な教養)。また，授業は，指名して質問をしながら行い(アクティブラーニング)，質問への応答ができる力を身につける(コミュニケーション力)。 This class is designed to enhance expertise in the environmental field. The course also develops skills for evaluating and prioritizing values under constraints of budget and resources by assigning tasks related to environmental standards and regulations. Additionally, the course encourages students to develop international literacy skills by using databases on chemical toxicity information. The class adopts an active learning style through discussions between the instructor and students. This approach helps students enhance their communication skills through active participation and responses.",
  "teachingMethod": "講義形式でおこなう。 少人数の場合には指名して意見を述べてもらいながら，1回の授業中に最低2回は各自が発言できるように授業をする(アクティブラーニング)。授業資料をLMS(Moodle)上にあらかじめ掲出しておくので参照すること。PCは資料の閲覧(資料を印刷してきた場合などは不要)，および，授業時間外のデータベースへのアクセス(宿題への解答)に使用。 This class will be conducted in a lecture format. During each session, students will be called on to share their opinions at least twice (an active learning style). Students can obtain course materials from the LMS (Moodle). A laptop PC will be used for viewing the materials (printing them beforehand is optional) and for accessing databases to prepare homework assignments.",
  "notes": "この科目を履修するにあたって，前もって履修すべき科目は指定しない(特定の環境分野に関する基礎知識を前提とした講義ではない)。また，しっかり授業に参加すること。「参加」とは出席だけで達成されるのではなく，授業内で発言したりすることを含む。 There are no prerequisites for this course; in other words, no specific courses in the environmental field need to be completed beforehand. Additionally, active participation through class discussions is required.",
  "preparation": "レポート課題を準備することが必要である。また，講義内容の理解，用語の理解について，予習・復習教材をmoodle上で提供する。 It is necessary for students to prepare assignments for the class. Several materials for learning are provided on the LMS (Moodle).",
  "evaluation": "授業への十分な参加をしたものに対して，授業内での質問や課題への回答(50%)，レポート(50%)を総合して評価する。なお，履修人数が多数となった場合には，授業内での回答に代えて試験を実施する場合がある。授業は対話方式で行っているので，学生の発言には，授業内でフィードバックをする。提出されたレポートについても，その内容を次回の授業で紹介する。 The grading is based on 50% assignments and 50% class discussion. The paper-based examination will be considered only if too many students take this course. Feedback will be given to students through discussions in an active-learning style lecture.",
  "textbook": "なし",
  "referenceMaterials": "講義資料をLMS(Moodle)上に掲載するので，それを予め，ダウンロードして講義にのぞむことが望ましい。 Course materials can be downloaded from the LMS (Moodle).",
  "schedulePlan": "第1回:環境基準などの規制値の算出の考え方 第2回:化学物質の健康への影響（無影響濃度，安全係数，耐用1日摂取量，実質安全量） 第3回:環境DNAと次世代シーケンサー，新型コロナウイルスの下水疫学 第4回:マイクロプラスチック問題 第5回:地球温暖化のメカニズム，現状，対策 第6回:水ビジネスの現状と膜分離による水処理技術 第7回:管理の原則(PDCA, ISO, B/C) First session: Environmental standards and regulations. Second session: Environmental toxicology with technical terms such as no observable effect levels. Third session: Next-generation sequencing for eDNA analysis. Fourth session: Microplastics in the environment. Fifth session: Basic mechanisms and countermeasures for global warming. Sixth session: Latest developments in water and wastewater treatment technologies. Seventh session: Environmental management tools such as LCA and B/C analysis."
}