{
  "subjectName": "分子生物学特論",
  "instructors": [
    "矢野和義(応用生物学部応用生物学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGB11401",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "木",
      "period": 2
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程バイオニクス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ２０３",
  "lastUpdated": "2025/03/31",
  "overview": "近年の遺伝子組換え技術のめざましい発展に伴い、分子レベルで生体反応を理解する分子生物学が生命科学分野の大きな潮流となっている。本講義では、遺伝子の本体であるDNAの構造、半保存的複製、突然変異、リボソームの構造などを分子レベルで学ぶ。また、重要な発見に至った歴史的背景や、英語文献の読み方なども解説する。 With the remarkable advancement of recombinant DNA technology in recent years, molecular biology, which seeks to understand biological reactions at the molecular level, has become a major trend in the life sciences. In this course, students will learn about the structure of DNA, semi-conservative replication, mutations, and the structure of ribosomes at the molecular level. Additionally, the historical context leading to important discoveries and the methods for reading scientific literature in English will also be explained.",
  "objectives": "本講義では、分子生物学についての実学に基づく専門力を身につけることを目指す。すなわち、DNAの化学的・立体的特徴を踏まえて、半保存的複製、突然変異、リボソームの構造、タンパク質合成などに関する現象を分子レベルで説明できること、また科学英語文献の講読方法や文法について修得することを到達目標とする。英語文献講読においては、国際的な教養力を身につけることも目指す。 The aim of this course is for students to gain specialized knowledge based on practical expertise in molecular biology. Specifically, students should be able to explain phenomena such as semi-conservative replication, mutations, ribosomal structure, and protein synthesis at the molecular level, based on the chemical and spatial characteristics of DNA. The course will also teach students how to read scientific English literature and improve their understanding of grammar. An additional goal is to help students develop international cultural literacy through the reading of English scientific literature.",
  "teachingMethod": "主に講義形式で行い、講義資料は前日までにMoodleに掲示する。資料は穴埋め形式であるため、講義までに各自印刷して、講義中に解答を書き込むことを想定している。このため、ノートPCは必ずしも必要ではない。また講義内容に該当する英語文献を適宜紹介し、学生が事前に精読したうえで、分担を決めて講義中に発表する回も設ける。すべての回で、指名―回答―解説を中心としたアクティブラーニングのスタイルを盛り込んだ授業を行う。 The course will primarily be conducted in lecture format. Lecture materials will be posted on Moodle by the day before each class. The materials are in a fill-in-the-blank format, so students are expected to print them out and fill in the answers during the lecture. For this reason, laptops are not necessarily required. Relevant English literature will be introduced throughout the course, and students will be expected to read the materials in advance, with presentations on assigned topics during class. Active learning will be emphasized in all classes, focusing on a cycle of question, answer, and explanation.",
  "notes": "講義資料の予習、特に復習を重点的に行うこと。また学部で行った生物系の講義を復習し、確実に理解してから講義に臨むこと。 It is essential to review lecture materials in advance, especially focusing on reviewing relevant content from undergraduate biology courses to ensure a solid understanding before attending lectures.",
  "preparation": "事前にMoodleに掲示した講義資料を講義までに読んでおくこと。 Students are required to read the lecture materials posted on Moodle prior to each class.",
  "evaluation": "最終レポート85％、各回のアクティブラーニングでの回答15％として評価する。文献講読の発表内容に関するフィードバックはその場で行う。 Final report: 85% Active learning participation during each class: 15% Feedback will be provided immediately after presentations of the literature readings.",
  "textbook": "指定しない。 None specified.",
  "referenceMaterials": "「生命科学のコンセプト 分子生物学」小関治男・永田俊夫・松代愛三・由良隆 著、化学同人 「ライフサイエンスのための 分子生物学入門」駒野徹・酒井裕 著、裳華房 「ゲノム工学の基礎」野島博 著、東京化学同人",
  "schedulePlan": "第1回:DNAの構造と解明に至る歴史的背景 第2回:ギブズの自由エネルギー、DNAの半保存的複製 第3回:DNAポリメラーゼⅠ、Ⅲの構造と機能 第4回:演習：英語文献の講読1（DNA polymerase） 第5回:DNAの突然変異の分類 第6回:リボソームの構造とタンパク質合成 第7回:演習：英語文献の講読2（Klenow fragment） Lesson 1: The structure of DNA and the historical context leading to its discovery Lesson 2: Gibbs free energy and semi-conservative replication of DNA Lesson 3: Structure and function of DNA polymerases I and III Lesson 4: Workshop: Reading English literature 1 (DNA polymerase) Lesson 5: Classification of DNA mutations Lesson 6: The structure of ribosomes and protein synthesis Lesson 7: Workshop: Reading English literature 2 (Klenow fragment)"
}