{
  "subjectName": "分子腫瘍学特論",
  "instructors": [
    "岡田麻衣子(応用生物学部応用生物学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGB10801",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "月",
      "period": 1
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程バイオニクス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ２０３",
  "lastUpdated": "2025/01/06",
  "overview": "バイオテクノロジーの飛躍的な発展と共にがんの発症や悪性化の仕組みが分子レベルで明らかになりつつある。一方で、超高齢化社会に突入した我が国ではがんの罹患率・死亡率は増加の一途をたどっており、新たな抗がん剤の開発は急務となっている。 本講義ではがん治療をテーマとした最新の研究トピックスを適宜紹介し、抗がん剤の開発の基盤となる分子生物学の知識や技術について解説する。また、これらの理解を深めることで研究遂行における論理的思考について学ぶ。 The advent of biotechnology has led to a rapid advances in our understanding of the molecular mechanisms underlying cancer development and malignant transformation. However, as our country faces the challenges of an aging society, the cancer incidence and mortality rates of cancer continue to rise, making the development of new anticancer drugs an urgent priority. This lecture will introduce cutting-edge research topics in cancer therapy and provide a clear explanation of the molecular biology knowledge and techniques that underlie the development of anticancer drugs. In addition, students will enhance their understanding of these concepts while cultivating the reasoning skills essential to conducting research.",
  "objectives": "本講義では、分子腫瘍学についての実学に基づく専門力を身につけることを目指す。「がん治療」をテーマとしたトピックスの紹介を通じて、創薬研究の基盤となる分子生物学の知識や技術の理解を目標とする。 これらの理解を通じて研究データの解釈や問題点の分析、研究計画の立案といった、研究の遂行における一連の論理的な思考を身につけることを目指す。 This course is designed to equip students with practical and specialized skills in molecular oncology. By exploring topics related to cancer therapy, the course aims to help students understand the molecular biology knowledge and techniques fundamental to drug discovery research. Furthermore, the course is structured to foster students' reasoning and thinking skills, which are indispensable for conducting research. These skills include interpreting research data, analyzing problems, and formulating research plans.",
  "teachingMethod": "パワーポイントを用いて講義をすると共に、指名－回答－解説を中心としたアクティブラーニングを適宜取り入れる。一部穴埋め形式の講義資料を事前にダウンロードして予習をしてから授業に臨むこと。また、講義課題ではPCを使用するため、PCを必ず持参すること。 研究結果の解釈や問題点の分析・研究計画については、具体的な研究データを用いて解説するとともに、模擬データを提示して演習を行う。また、一部の講義では英語でのプレゼンテーションの練習やグループワークを取り入れた演習も行う。 Lectures will be given using PowerPoint, and active learning will be incorporated as appropriate, focusing on nomination-response-explanation. Students are expected to prepare for the lecture by downloading fill-in-the-blank lecture materials and bringing their own PCs for the lecture assignments. Sample data will be presented for exercises to practice interpreting of research results, problem analysis, and research plans.&nbsp;&nbsp;In some lectures, students will also practice giving English presentations and doing group work exercises.",
  "notes": "生命科学ⅠやⅡ、細胞生物学、分子生物学などの生物関連の講義をよく復習してから受講すること。 Before taking this course, you should review the content of biology-related lectures such as Life Science I and II, Cell Biology, and Molecular Biology.",
  "preparation": "予習：Moodleにアップロードした講義資料を確認すること。講義冒頭で前講義回の課題を解説するので、理解が深まるように事前に各自の解答と講義資料を見返しておくこと。 復習：講義内容を踏まえて各講義課題を提出すること。 Preparation: Check the lecture materials uploaded to Moodle. The assignment from the previous lecture will be explain&nbsp;&nbsp;at the beginning of the lecture, so please review your answers and the lecture materials beforehand to deepen your understanding. Review: Submit each lecture assignment based on the lecture content.",
  "evaluation": "全ての講義への出席を前提とし、講義ごとに理解度チェックを目的とした課題を課す。課題については次回の講義冒頭において解説してフィードバックする。各回の課題を50%、最終レポートを50%として評価する。 Attendance at all lectures is&nbsp;&nbsp;required. Each lecture will include an assignment to check your level of understanding. The assignment will be explained at the beginning of the next lecture, and feedback will be given. Each assignment will be assessed as 50%, and the final report will be assessed as 50%.",
  "textbook": "指定しない Not specified",
  "referenceMaterials": "「THE CELL 細胞の分子生物学」日本語版 第6版 &nbsp;&nbsp;・著者：B. Alberts、A. D. Johnson、J. Lewis、D. Morgan、M. Raff、 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;K. Roberts、P. Walter &nbsp;&nbsp;・出版社：ニュートンプレス Molecular biology of The Cell (6th) &nbsp;&nbsp;・Author: B. Alberts, A. D. Johnson, J. Lewis, D. Morgan, M. Raff, &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;K. Roberts and P. Walter ・Publisher: W. W. Norton &amp; Company",
  "schedulePlan": "第1回：がん細胞における遺伝情報の発現・維持機構の破綻 第2回：分子標的薬開発の意義 第3回：DNA修復機構の破綻に基づくがん治療 第4回：転写制御機構に基づくがん治療 第5回：転写制御機構の解析手法 第6回：タンパク質分解機構に基づくがん治療 第7回：タンパク質分解機構の解析手法 1st: The breakdown of the expression and maintenance mechanisms of genetic information in cancer cells 2nd: The significance of developing molecular-targeted drugs 3rd: Anticancer treatment based on the breakdown of DNA repair mechanisms 4th: Anticancer treatment based on transcriptional regulatory mechanisms 5th: Methods for analyzing transcriptional regulatory mechanisms 6th: Anticancer treatment based on protein degradation mechanisms 7th: Methods for analyzing protein degradation mechanisms"
}