{
  "subjectName": "酵素学特論",
  "instructors": [
    "木村将大(応用生物学部応用生物学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGB13801",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "火",
      "period": 1
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程バイオニクス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ３０２",
  "lastUpdated": "2025/01/06",
  "overview": "生体内の複雑な化学反応を触媒するのが酵素である。生体触媒である酵素は食品、化粧品、医薬品、環境、工業など様々な分野から注目されている。本講義ではタンパク質の基礎知識、酵素の特性を学び、酵素学の基礎と応用について学習する。酵素の特性として特定の化学反応を効率よく進行させる仕組み，反応を調節する仕組みを理解する。また、実際の研究成果を教材に酵素および酵素反応の評価法や酵素を応用した研究例を解説する。講義の半分は日本語で、もう半分を英語で授業を行う予定である。 Enzymes catalyse complex chemical reactions in living organisms. As biological catalysts, enzymes are attracting attention from a wide range of fields, including food, cosmetics, pharmaceuticals, the environment and industry. This lecture will cover the basics of protein and enzyme characteristics, and the fundamentals and applications of enzymology. The aim of the lecture is to understand the mechanisms that allow enzymes to efficiently catalyse specific chemical reactions and regulate reactions. The lecture will also use actual research results as teaching materials to explain evaluation methods for enzymes and enzyme reactions, and examples of research that uses enzymes.Half of the lectures will be in Japanese, and the other half in English.",
  "objectives": "本講義では、酵素学についての基礎知識の定着から、実学に基づく専門知識を身につけることを目指す。基礎知識としてアミノ酸、ペプチド、タンパク質への理解をすること。生体触媒としての酵素の性質、酵素反応のメカニズムについて説明できること、PCを使用した酵素研究に必要なタンパク質の配列や構造の調べ方を修得することを到達目標とする。研究論文の講読を通して、実学に基づく専門能力を身につけることも目指す。 This lecture aims to help students acquire a basic knowledge of enzymology and specialist knowledge based on practical science. Students will aim to understand the basics of amino acids, peptides and proteins. The learning objectives are to be able to explain the properties of enzymes as biological catalysts and the mechanisms of enzymatic reactions, and to learn how to use a PC to investigate the sequences and structures of proteins necessary for enzyme research. This lecture also aims to help students acquire specialist skills based on practical science through reading research papers.",
  "teachingMethod": "主に講義形式で行い、指名して意見を述べてもらうアクティブラーニングの形式をとる。ノートPCを使用する講義がある。自身でノートPCを操作し、DNA配列やアミノ酸配列、タンパク質の構造の調べ方を学ぶ。また、事前に講義資料をMoodleにアップロードする。講義の終わりには課題を出題する。課題の提出もMoodleを使用する。 The lectures will mainly be given in a lecture format, with an active learning approach where students are asked to give their opinions when called upon. Some lectures will use laptop computers. Students will operate the laptop computers themselves and learn how to investigate DNA sequences, amino acid sequences and protein structures. Students will also upload lecture materials to Moodle in advance. At the end of the lecture, students will be given an assignment. They will also use Moodle to submit their assignments.",
  "notes": "特に、前もって履修しておくべき科目は指定しない。酵素学に関心を持っていること、また、タンパク質に関する基礎知識を理解していることが望ましい。 In particular, there are no subjects that you must take beforehand. It is desirable that you have an interest in enzymology and have a basic knowledge of proteins.",
  "preparation": "予習が必要な場合は、講義中に指示する。事前に講義資料をダウンロードして予習する。ノートPCを使用する講義の予習復習は行うこと。最終講義後に最終課題を提出してもらうので、各講義を理解するために授業の復習を行うこと。 授業スライドの内容の予習60分 多言語での予習60分 授業スライドの内容の復習60分 課題60分 If you need to do some preparation, I will give you instructions during the lecture. Download the lecture materials in advance and do some preparation. If you are using a laptop, you should do some preparation and review for the lecture. You will be asked to submit a final assignment after the final lecture, so you should review the class to understand each lecture. 60 minutes of preparation for the content of the lesson slides 60 minutes of preparation in multiple languages 60 minutes of review of the content of the lesson slides 60 minutes of assignments",
  "evaluation": "出席と最終レポートの提出を前提とし、毎回の講義課題レポート70%と最終レポート30%で評価する。課題のフィードバックは講義中に行う。 Grades will be based on attendance and submission of the final report, and will be assessed as 70% for each lecture assignment report and 30% for the final report. Feedback on assignments will be given during the lectures.",
  "textbook": "指定しない Not specified",
  "referenceMaterials": "ヴォート基礎生化学 第5版(東京化学同人) イラスト基礎からわかる生化学（構造・酵素・代謝）坂本順司 著 （裳華房）",
  "schedulePlan": "第1回：タンパク質の基礎 第2回：酵素の特徴 第3回：酵素の性質 第4回：酵素の反応機構 第5回：データベースを用いた酵素の機能と構造解析 第6回：酵素の反応速度論 第7回：酵素の研究 Lesson 1: The Basics of Proteins Lesson 2: Characteristics of Enzymes Lesson 3: Properties of Enzymes Lesson 4: Reaction Mechanisms of Enzymes Lesson 5: Functional and Structural Analysis of Enzymes Using Databases Lesson 6: Reaction Kinetics of Enzymes Lesson 7: Research on Enzymes"
}