{
  "subjectName": "コロイド界面化学特論",
  "instructors": [
    "柴田雅史(応用生物学部応用生物学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGB14101",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "金",
      "period": 2
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程バイオニクス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ２０３",
  "lastUpdated": "2025/03/11",
  "overview": "本授業は、コロイド界面化学の最新技術を学び、それらが化粧品製品の処方設計にどのように応用されているのかを、講義および実習を通して学ぶことを目的とする。授業で取り上げる化粧品製品の題材として、油性ゲル製剤である口唇スティック化粧料（リップクリーム）を用いる。 授業は前半と後半に分かれる。前半では、水系および油系ゲルを中心に、コロイド界面化学の基礎から最新技術までを講義形式で学ぶ。後半では、リップクリームの処方を題材に、どのような界面化学技術が用いられているのかを解析し、レポートの作成を行う。 This course aims to provide students with an understanding of the latest technologies in colloid and interface chemistry and their applications in the formulation design of cosmetic products through lectures and practical exercises. The course will focus on oil-based gel formulations, specifically lip stick cosmetics (lip balms), as a case study. The course is divided into two parts. In the first half, students will learn the fundamentals and advanced technologies of colloid and interface chemistry, with a focus on aqueous and oil-based gels, through lectures. In the second half, students will analyze the interface chemistry technologies used in lip balm formulations and prepare a report based on their findings.",
  "objectives": "本授業では、前半の講義部分で化粧品・食品。医薬品分野についての実学であるコロイド界面化学に基づく専門力を身につけることを目指す。後半の製品解析では、界面化学の見地から各成分が配合される目的と、それが統合された処方全体の設計思想と性能を推察することで、「論理的思考力」および「分析・評価力」を身につけることを目標とする。 本授業を履修することにより、コロイド界面化学技術に関する最新の知識を習得し、その知識が化粧品をモデルとした製品の設計にどのように活用されているかを理解することができる。 This course covers colloid and interface chemistry applied in cosmetics, food, and pharmaceuticals. In the first half, students will gain specialized knowledge, while the second half focuses on product analysis to develop logical thinking and analytical skills. By the end, students will acquire up-to-date knowledge of colloid and interface chemistry and understand its application in product design, using cosmetics as a model.",
  "teachingMethod": "前半では、化粧品、食品、医薬品製剤におけるコロイド界面化学の実務的かつ最新の技術について、講義形式で解説する。後半では、リップクリーム製品の処方について、その設計思想（目的とする性能）を整理し、さらにその性能を実現するためにどのような界面化学技術が活用されているかを推察するアクティブラーニングを行う。授業終了後、レポートを提出することとする。なお、授業にはノートPCを持参すること。 The course consists of two parts: Lecture-based learning (first half): Covers practical and latest technologies in colloid and interface chemistry for cosmetics, food, and pharmaceuticals. Active learning (second half): Students analyze lip balm formulations, examine design concepts, and infer the relevant interface chemistry technologies.",
  "notes": "本授業では化粧品製品を演習の題材として扱うが、学ぶコロイド界面化学技術は食品加工や医薬品製剤技術にも応用されている。そのため、化粧品専攻でない学生も履修対象とし、講義および発表方法に工夫を凝らし、化粧品分野の知識がなくても履修に支障がないよう配慮している。 Although this course uses cosmetic products as case studies, the colloid and interface chemistry techniques covered are also applicable to food processing and pharmaceutical formulations. Therefore, students who are not specializing in cosmetics are also welcome to take the course. The lectures and presentations are designed to ensure that students without prior knowledge of the cosmetics field can follow the course without difficulty.",
  "preparation": "講義で使用する説明資料は、事前に授業サイトにアップロードされるため、授業に参加する前に必ず熟読すること。さらに、授業後にはその内容を再確認すること（予習120分、復習120分程度）。 演習の説明についても、同様の方法で進めること。 Lecture materials are available online in advance, and students must review them before and after class (approximately 120 minutes each). The same applies to exercises and practical sessions.",
  "evaluation": "講義部分でのクイズや意見発表を20％、レポートを80%で評価をおこなう。授業の最終回でフィードバックをおこなう。 Quizzes and class discussions: 20%、Final report: 80% Feedback will be provided in the final session of the course.",
  "textbook": "おもしろサイエンス リップ化粧品の科学 日刊工業新聞社",
  "referenceMaterials": "化粧品成分検定公式テキスト 実業之日本社 日本化粧品工業連合会 http://www.jcia.org/n/ Cosmetic-Info.jp http://www.cosmetic-info.jp/ その他、適宜必要書類を授業サイトからダウンロードする。",
  "schedulePlan": "第1回:コロイド界面化学の概略と化粧品・食品・医薬品への応用 第2回:水系ゲルの種類とゲル化機構 第3回:オイルと油性ゲル 第4回:油性ゲルの物性制御 第5回:油性ゲル製剤の課題と最新技術 第6回:化粧品成分および処方の解析方法 第7回:実習：化粧品製品の解析レポート（第1回）のフィードバック Session 1: Overview of colloid and interface chemistry and its applications in cosmetics, food, and pharmaceuticals Session 2: Types of aqueous gels and gelation mechanisms Session 3: Oils and oil-based gels Session 4: Control of the physical properties of oil-based gels Session 5: Challenges and latest technologies in oil-based gel formulations Session 6: Analysis methods for cosmetic ingredients and formulations Session 7: Practical session: Feedback on cosmetic product analysis reports (Session 1)"
}