{
  "subjectName": "視覚認知機構",
  "instructors": [
    "菊池眞之(コンピュータサイエンス学部コンピュータサイエンス学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGC14001",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "月",
      "period": 2
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ２０３",
  "lastUpdated": "2025/03/21",
  "overview": "ヒトは動的に変化する環境を巧みに認知しつつ活動している。この外界認知において重要な役割を担うのが視覚情報処理である。本講義ではヒトの脳の視覚系がどのようなメカニズムの情報処理を行っているのかを神経生理学，心理物理学，神経回路モデル等の知見を紹介しながら論じてゆく。 Humans perform various actions in a dynamically changing environment, guided by elaborately designed perception system. Visual information processing plays an important role in this perception of the outside world. This lecture will discuss the mechanism of information processing in the visual system of the human brain, introducing findings from neurophysiology, psychophysics, neural network models, etc.",
  "objectives": "本講義の履修によりヒトの視覚認知の性質や仕組みに関する知見を深める。さらに人工画像理解システム（ロボット，セキュリティ，画像検索，etc.）やユーザインタフェース，Web・工業製品デザイン等の様々な分野への応用の発想ができるようになることも目指す。 By taking this lecture, you will gain a deeper understanding of the nature and mechanisms of human visual cognition, and also be able to come up with ideas for applications in various fields, such as artificial image understanding systems (robots, security, image retrieval, etc.), user interfaces, web and industrial product design, etc.",
  "teachingMethod": "授業は講義中心で進める。レポート課題や小テストを出題する。 This class will mainly consist of lectures. Occasionally, report assignments or tiny tests will also be given.",
  "notes": "ノートPCを毎回持参すること。 Please bring your laptop with you every time.",
  "preparation": "授業で理解を深めるために復習すること。分からない点があれば質問したりして理解に努めること。 Please review the lectures to deepen your understanding. If there is anything you don't understand, ask questions and try to understand.",
  "evaluation": "レポートや小テストにより評価する。論述レポート，実装レポートの評価はそれぞれ，講義に即した議論を根源的・網羅的に行えているか、機能の本質的理解に根差した独自実装を行えているかを重視する。評価におけるレポートの比重は約8割とする。 Evaluation will be based on the reports and tiny tests. Evaluations of descriptive reports and implementation reports will focus on whether arguments are fundamental and exhaustive based on the lectures, and whether submitted works are originally implemented through the essential understanding of the function, respectively. The weight of reports in the evaluation is roughly 80%.",
  "textbook": "特に指定しない。 Not specified.",
  "referenceMaterials": "村上郁也：「イラストレクチャー認知神経科学」，オーム社（2010） 乾敏郎，吉川佐紀子，川口潤 編：「よくわかる認知科学」，ミネルヴァ書房（2010） 横澤一彦：「視覚科学」，勁草書房（2010） 乾敏郎 監修：「感覚・知覚・認知の基礎」，オーム社（2012） 高橋宏知：「メカ屋のための脳科学入門-脳をリバースエンジニアリングする」(2016) 福島邦彦，斎藤秀昭，大串健吾：「視聴覚情報処理」(2001)",
  "schedulePlan": "第1回:脳科学・視覚科学を構成する諸領域の概略，単一神経細胞の処理 第2回:神経回路網の基礎，視覚系の概略，初期視覚（網膜～エッジ検出） 第3回:初期視覚（輪郭知覚，コントラスト知覚等） 第4回:初期～中期視覚（補完等） 第5回:中期視覚（図地分離等） 第6回:中期～高次視覚（パターン認識・運動知覚等） 第7回:視覚的注意・眼球運動，計算論的モデル Session 1: Overview of the various areas that make up neuroscience and vision science, processing of single neurons Session 2: Basics of neural networks, overview of the visual system, early vision (retina to edge detection) Session 3: Early vision (contour perception, contrast perception, etc.) Session 4: Early to intermediate vision (visual completion, etc.) Session 5: Intermediate vision (figure-ground separation, etc.) Session 6: Intermediate to higher-level vision (pattern recognition, motion perception, etc.) Session 7: Visual attention, eye movement, computational models"
}