{
  "subjectName": "視覚的注意と認知",
  "instructors": [
    "伝保昭彦(コンピュータサイエンス学部コンピュータサイエンス学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGC14101",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "火",
      "period": 2
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ２０３",
  "lastUpdated": "2025/01/06",
  "overview": "人間は常に大量の視覚的情報を外界から受け取っているが、その全てを処理することは不可能である。そこで、必要な情報を選択したり、不必要な情報を抑制したりしなければならない。このような認知的機能のことを「視覚的注意」という。本授業においては視覚的注意の働きや理論、および視覚的注意に関係する心理的な現象などについて紹介する。また、視覚的注意に関係する諸問題について各自で探求し、認知心理学的な観点から議論を行う。 Human beings consistently receive a tremendous amount of visual information; however, not all of it can be processed. Consequently, it is necessary to select essential information and suppress irrelevant information. This cognitive function is called \"visual attention\". In this class, theories and functions of visual attention, as well as psychological phenomena related to visual attention, are introduced. Each student is required to investigate issues related to visual attention and discuss them from the viewpoint of cognitive psychology.",
  "objectives": "人間が行っている情報処理に関する理論や基礎知識を身に付けることで、実学に基づく専門能力を育成する。また、主体的に必要な先行研究の調査を行い、その成果を論理的にまとめる能力を高めるとともに、他者に理解しやすい形で提示する能力を養う（論理的な思考力、コミュニケーション能力）。 To cultivate practical professional abilities, students learn theories and foundational knowledge related to human information processing. Students are encouraged to actively research previous studies, summarize them, and present them in a logical manner.",
  "teachingMethod": "前半の授業は主に講義形式で行う。後半の授業では前半に紹介した理論や実例に関する先行研究の調査をグループに分かれて行う。調査の結果は授業内で発表する。 授業資料の配布や先行研究の調査、資料の作成などのため、PCは全回必携とする。 The first half of the class is conducted mainly in lecture style. In the second half of the class, students work in groups to research previous studies related to the theories and examples introduced in the first half of the class. The results of the research are presented in class. Students are required to bring a PC to all classes in order to distribute class materials, research previous studies, and prepare materials.",
  "notes": "本授業ではグループワークや発表を行うことがある。授業中に指示があった調査などは指定された期日までに必ず終えること。 In some lessons, students need to engage in group work and make presentations. All students must comply with the deadlines instructed in class.",
  "preparation": "提出物は指定された期日までに提出すること。また、先行研究の調査を積極的に行うこと。 All documents that are to be submitted must be turned in by the deadlines. Students are encouraged to actively explore previous studies.",
  "evaluation": "前半の授業の提出課題を60%、先行研究の調査と発表内容を40%として評価する。 Documents that are to be submitted in the first half account for 60% of the score. The investigation and presentation of previous studies account for 40% of the score.",
  "textbook": "指定なし。 There is no specific textbook.",
  "referenceMaterials": "河原・横澤(2015) シリーズ統合的認知1 注意 選択と統合 勁草書房 原田・篠原（編）(2011) 現代の認知心理学4 注意と安全 北大路書房 Kawahara &amp; Yokosawa (2015). Series \"Togoteki-ninchi1 Sentaku to Togo\" Keiso shobo (printed in Japanese). Harada &amp; Shinohara, eds. (2011). \"Gendai-no-ninchishinrigaku4 Chui to Anzen\" Kitaoji shobo(printed in Japanese)",
  "schedulePlan": "第1回：ガイダンス：本授業の進め方、注意とは何か 第2回：注意と認知の諸理論 第3回：注意と認知に関する研究 第4回：注意と認知研究の応用 第5回：先行研究の調査 第6回：発表の準備 第7回：調査内容の発表、まとめ 1. Guidance: How to Proceed with This Lesson / What is Attention? 2. Theories of Attention and Cognition 3. Previous Studies of Attention and Cognition 4. Attention and Cognition Research for Application 5. Investigating Previous Studies 6. Preparation for Presentation 7. Presentation &amp; Summary"
}