{
  "subjectName": "数理言語学",
  "instructors": [
    "欅リベカ(コンピュータサイエンス学部コンピュータサイエンス学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGC13501",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "水",
      "period": 2
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ２０３",
  "lastUpdated": "2025/01/06",
  "overview": "数理言語学は、自然言語の文法や意味に関する構造・法則を数理的にモデル化することを目指す学問である。言語学、論理学、哲学、自然言語処理といった異なる分野にまたがる学問で、自然言語をコンピュータで処理する上で、現在の自然言語処理の主流とは異なるアプローチを提供する。この授業では自然言語の文の意味に着目し、論理学の手法を用いて意味の法則性を分析する方法を学ぶ。 Mathematical linguistics aims to mathematically model the structures and rules of grammar and meaning in natural languages. It is an interdisciplinary field spanning linguistics, logic, philosophy, and natural language processing, offering an approach distinct from mainstream natural language processing. In this course, we focus on the meaning of sentences in natural languages and study methods to analyze the rules of meaning using logical tools.",
  "objectives": "・文の意味の異なるタイプについて、推論の実例を通して理解し、説明できるようになる。また文の意味を分析する上で基盤となる概念（真理条件、合成性、間接的解釈）について理解する（分析・評価能力、論理的な思考力） ・集合、関係、関数、命題論理、述語論理、といった数学的な道具立てについて理解し、それらが自然言語の文の意味を分析する際にどのように用いられるのかを理解する（分析・評価能力、問題解決力、論理的な思考力） - Understand and explain different types of sentence meanings through inference examples, as well as comprehend the fundamental concepts for analyzing sentence meaning (truth conditions, compositionality, indirect interpretation) (Analytical and evaluative skills, logical thinking). - Gain an understanding of mathematical tools such as sets, relations, functions, propositional logic, and predicate logic, and learn how these are used in analyzing the meaning of sentences in natural languages (Analytical and evaluative skills, problem-solving abilities, logical thinking).",
  "teachingMethod": "・授業は教科書を使った輪講形式で行う。 ・事前に受講生全員に対して教科書の担当範囲を割り当てる。各回では、説明役の受講生が自身で作成した資料をもとに、教科書の担当範囲についての説明を行う。 ・説明役の受講生の説明をもとに、他の受講生は内容についての質問や議論を行う。 - The course will be conducted in a seminar format using the textbook, where students will take turns presenting assigned sections. - In advance, each student will be assigned a section of the textbook to present. For each class, the assigned student will explain the section based on materials (slides, handouts) they have prepared. - Based on the explanations, the other students will ask questions and engage in discussions about the content.",
  "notes": "毎回、ノートPCと教科書（電子ファイル）を持参すること。 Students must bring a laptop and the textbook (provided in digital format) to each class.",
  "preparation": "・自身が説明役を担当する回については、事前に教科書の担当範囲を読んで内容を理解し、スライドやレジュメ等の資料を作成し、それを用いて授業で説明できるようにすること。担当範囲に練習問題が含まれる場合には、その解答案も用意すること。 ・担当回以外では、事前に教科書の範囲を読んで、授業内での議論に参加できるようにすること。 復習として、授業内容の要約と感想をフォームから提出する。疑問点は授業中の議論を通して解消することが望ましいが、残った疑問点があった場合にはフォームに記載する。 Preparation for Class - For the sessions where students serve as the presenter, they must read and understand the assigned section in advance, prepare materials such as slides or handouts, and be able to explain the content in class. If the section includes exercises, they must also prepare the answer. - For sessions where students are not the presenter, they should read the section in advance and be ready to participate in class discussions. As a review, students are required to submit a summary and their impressions or comments on the class through a web form. While it is preferable to resolve any questions during class discussions, unresolved questions should be included in the form.",
  "evaluation": "・担当回で適切な資料を用いて発表を行う（40点） ・授業の議論に参加し、活発に質問・コメントを行う（25点） ・毎回、授業内容の要約と感想を提出する（35点） 60点以上を単位として認める。 ただし、説明役を担当しなかった場合、出席回数が足りない場合は不合格とする。 - Present the assigned section using appropriate materials (40 pts). - Actively participate in discussions, ask questions, and contribute comments (25 pts). - Submit a summary and comments via the form after each class (35 pts). Credit will be granted if you earn 60 points or more, but you will fail if you do not present or have insufficient attendance.",
  "textbook": "Invitation to Formal Semantics (Manuscript), Elizabeth Coppock &amp; Lucas Champollion https://eecoppock.info/semantics-boot-camp.pdf",
  "schedulePlan": "第1回：導入(1) 第2回：導入(2) 第3回：集合、関係、関数(1) 第4回：集合、関係、関数(2)／命題論理(1) 第5回：命題論理(2) 第6回：述語論理(1) 第7回：述語論理(2) Class 1: Introduction (1) Class 2: Introduction (2) Class 3: Sets, relations, and functions (1) Class 4: Sets, relations, and functions (1), Propositional logic (1) Class 5: Propositional logic (2) Class 6: Predicate logic (1) Class 7: Predicate logic (2)"
}