{
  "subjectName": "ビッグデータ工学特論",
  "instructors": [
    "伏見卓恭(コンピュータサイエンス学部コンピュータサイエンス学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGC13901",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "月",
      "period": 1
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ２０１",
  "lastUpdated": "2024/12/22",
  "overview": "Web2.0の普及以来，Web上には一般ユーザが生成した膨大な量のコンテンツが蓄積されている．これらビッグデータをマネジメントし，新たな価値を創造するための技術について学ぶ．これらの手法の数理的な基礎やアルゴリズムについて概要を解説する．本講義では，グラフデータや時系列データ，テキストデータ，地理空間データなどの処理方法や，我々の生活になくてはならない情報検索や情報推薦，可視化の基礎技術について学ぶ． === Since the spread of Web 2.0, a huge amount of content generated by ordinary users has been accumulating on the Web. This course will teach you about the technologies for managing this big data and creating new value. This will provide an overview of the mathematical foundations and algorithms of these methods. In this course, you will learn how to process graph data, time series data, text data, geospatial data, and other data, as well as the basic technologies of information search, information recommendation, and visualization, which are essential to our daily lives.",
  "objectives": "ウェブ上のデータから有用な知識を発見するための技術について理解・習得する．したがって本講義のラーニングアウトカムとして，現実のウェブデータを対象とした分析を実施するため「実学に基づく専門能力」，「分析・評価能力」を身につけることを目標とする． === This course aims to understand and acquire techniques for discovering useful knowledge from data on the web. Therefore, the learning outcome of this course is to acquire \"実学に基づく専門能力\" and \"分析・評価能力\" to conduct analysis of real web data.",
  "teachingMethod": "講義形式で技術の概要について説明し，Pythonによるサンプルプログラムを配布し，計算問題やアルゴリズムに関する練習問題を取り入れることで履修者の理解の定着を図る． 各講義後に，実データに対する処理プログラムを実装するような課題を毎回出題する．そのため，ノートPCは必携である． === An overview of the technology will be explained in a lecture format, sample programs written in Python will be distributed, and practice problems related to calculations and algorithms will be included to help students solidify their understanding. After each lecture, students will be given an assignment to implement a program to process real data. For this reason, a laptop is essential.",
  "notes": "講義におけるデータ分析手法の説明時には，線形代数（固有値・固有ベクトル），微分積分，離散数学，確率・統計（ベイズの定理，事後確率，確率分布），機械学習，ニューラルネットワーク，アルゴリズムの基礎知識を前提とする． 練習問題や課題に取り組む際には，Pythonによる計算プログラムを実装，実行する環境や基礎知識を前提とする． === When explaining data analysis methods in the lectures, students are assumed to have basic knowledge of linear algebra (eigenvalues ​​and eigenvectors), differential and integral calculus, discrete mathematics, probability and statistics (Bayes' theorem, posterior probability, probability distribution), machine learning, neural networks, and algorithms. When working on practice problems and assignments, students are assumed to have the environment and basic knowledge to implement and run calculation programs using Python.",
  "preparation": "毎授業後に宿題を課し，次回の授業開始までに提出させる． === Homework will be assigned after each class and must be submitted before the start of the next class.",
  "evaluation": "宿題：毎講義後に2,3題の問題を出題し，次回の講義開始までに提出させる． 評価は，宿題（100%）により判断する． 宿題の採点結果は，Moodleに記載する． 宿題の解答例は，次回講義時に公開する． === Homework: Two or three questions will be given after each lecture and must be submitted before the start of the next lecture. Grades will be based on homework (100%). Homework grading results will be posted on Moodle. Sample answers to the homework will be made public at the next lecture.",
  "textbook": "授業時に配布する講義資料による． === Based on lecture materials distributed during class.",
  "referenceMaterials": "第1回：「機械学習エンジニアのためのTransformers」Tunstall著，中山光樹訳，オライリー・ジャパン，2022 第2回：「コンピュータビジョンのための実践機械学習」Lakshmanan著，松田晃一 訳，オライリー・ジャパン，2023 第3回：「ネットワーク科学」Barabasi著，京都大学ネットワーク社会研究会訳，共立出版，2019 第4回：「実践 時系列解析」Nielsen著，山崎邦子訳，オライリー・ジャパン，2021 第5回：「Pythonによる地理空間データ分析」McClain著，廣川類訳，オライリー・ジャパン，2023 第6回：「基礎から学ぶ推薦システム」奥健太著，コロナ社，2022 第7回：「Nonlinear Dimensionality Reduction」Lee著，Springer，2010",
  "schedulePlan": "第1回：自然言語処理 第2回：画像処理 第3回：グラフデータ処理 第4回：時系列データ処理 第5回：地理空間データ処理 第6回：表形式データ処理 第7回：次元削減と可視化 === 1: Natural language processing 2: Image processing 3: Graph data processing 4: Time-series data processing 5: Geo-spatial data processing 6: Table data processing 7: Dimensional reduction and visualization"
}