{
  "subjectName": "分散システム",
  "instructors": [
    "串田高幸(コンピュータサイエンス学部コンピュータサイエンス学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGC12701",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "月",
      "period": 1
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "講義実験棟２０１",
  "lastUpdated": "2025/03/13",
  "overview": "分散システムは，コンピュータ間をネットワークで接続して利用できるようにするための統合化技術である．最近の大規模Webシステム，クラウド，ビッグデータ処理，IoT，ブロックチェーンは，分散システムで構築されている． この授業では，分散システムの基礎を体系立てて理解して，どのような機能を持っているのか，その特徴はどのようなものなのかを理解する（論理的な思考力）．また，分散システムが実際に利用されていることを理解する（実学に基づく専門の能力）． 授業は，履修学生がディスカッションリーダーとレビューアーになって，教科書の内容についての質問や議論を行なって内容の理解を深める（コミュニケーション能力）．",
  "objectives": "・分散システムの透過性，開放性，制約を理解して説明できるようにする． ・分散システムの種類と分散情報システムを体系立てて説明できるようにする． ・分散システムのアーキテクチャについて，基本的な形式と応用を理解して説明できるようにする． ・プロセス，スレッド，仮想化，コンテナ化を体系立てて説明できるようにする． ・クライアント・サーバモデルと，ソケット通信を理解して説明できるようにする． ・同期，複製，一貫性，フォールトトレーラント性を理解して説明できるようにする． ・分散ファイル，分散オブジェクト，分散Webシステムを理解して説明できるようにする． ・名前づけ，排他制御，選出アルゴリズム，位置システムを体系立てて説明できるようにする．",
  "teachingMethod": "・授業は，指定された教科書を使って輪講形式で行なう． ・授業では，履修学生が順番にディスカッションリーダーになって，教科書の各章の内容の説明をおこなう． ・ディスカッションリーダーの説明をもとに，他の履修学生全員は，レビューアーになって，説明した内容に関して，質問やコメントをする．その後に履修学生全員で議論を行なって，分散システムの技術的な内容の理解を深める．",
  "notes": "・授業には，ノートＰＣと教科書を必ず持ってくること． ・授業開始時間に遅刻しないこと． ・授業開始時間から5分以上遅れた場合，欠席とする．",
  "preparation": "予習として，ディスカッションリーダーは，教科書で担当の章を読んで理解して，授業で説明できるようにすること．（60分） 予習として，レビューアーは，教科書の章を事前に読んで理解して，授業でディスカッションに参加できるようにすること．(60分) 毎回，ディスカッションリーダーとレビューアーの両方を行なうことになるので，予習はディスカッションリーダーとレビューアーの両方を行なうこと． 復習は，授業中のよくわからないところの教科書と授業資料を読んで理解すること．（60分） 授業中に疑問が残ったところは，インターネットで検索して，複数の参考文献を読んで理解すること．それでも疑問が残ったところは，次の授業のときに質問するために，事前に資料を準備すること．（60分)",
  "evaluation": "成績評価は，以下の配分とする． １. レビューアーとして，教科書の各章の説明に対して積極的にディスカッションに参加することの評価．特に活発に質問や議論をしたことによる評価（70点） ２. ディスカッションリーダーとして，担当した箇所の明確な説明をして，議論を活発に活動したことに対する評価（20点） 3. 資料およびレポートの内容に対する評価（10点） 上記を合計した点数に授業態度（欠席，遅刻）を評価して，100点満点とする．60点以上を単位として認める．",
  "textbook": "Distributed Systems (Fourth Edition) by Maarten Van Steen, Andrew S. Tanenbaum https://www.distributed-systems.net/index.php/books/ds4/",
  "referenceMaterials": "デジタルシリーズ 分散システム 水野忠則監修 共立出版社(ISBN978-4-320-12351-9) 分散システム 真鍋義文著 森北出版(ISBN 978-4-627-81071-6)",
  "schedulePlan": "第１回 はじめに 第２回 アーキテクチャ 第３回 プロセス 第４回 通信 第５回 名前付け 第６回 協調 第７回 同期と複製"
}