{
  "subjectName": "Security in Programming",
  "instructors": [
    "宇田隆哉(コンピュータサイエンス学部コンピュータサイエンス学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGC81401",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "他",
      "period": null
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程コンピュータサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": null,
  "lastUpdated": "2025/01/07",
  "overview": "プロのプログラマが作成するソフトウェアであっても脆弱性は存在し、セキュリティに関するアップデートが頻繁に行われている。本講義では、脆弱性を含むコードが生成される理由を説明し、学生が実際にコードを生成して脆弱性の問題を体験しながら理解する。また、講義中に解説した脆弱性に関して、学生を交えた討論を行い、同様の実例を模擬的に再現して評価、考察し、レポートにまとめるものとする。可能であれば、脆弱性検出や対応の職務に取り組んでいる技術者と直接対話できる場を設けたいと考えている。本講義により、脆弱性に対する学生の興味の喚起が期待され、どのようにして安全なプログラムを構築できるかという対策意識の向上も期待される。 この授業では主に論理的な思考力と問題解決力を身につけることを目的としている。さらに、実学に基づく専門能力を鍛えることを目指している。",
  "objectives": "高度なプログラミングスキルを持つ人間が入念に設計してプログラミングしたソフトウェアであっても、脆弱性が存在する理由について理解し、どのように対応すればより安全なプログラミングが行えるか実践できるようになる。 授業中のディスカッション、課題を通して実学に基づく専門能力、論理的な思考力と問題解決力を養う。",
  "teachingMethod": "講義形式で行う。ただし、授業時間中に学生との対話、討論も行う。資料をオンラインで配布するためノートPCを必携とする。 反転授業ではないが、課題のプログラミングを次回の授業時間までに行っていないと理解できない授業内容を含む。",
  "notes": "授業中に行われる討論に参加しない者には単位を与えない。 コロナウイルス感染拡大などのやむを得ない理由や、日程調整などの都合により、脆弱性検出や対応の職務に取り組んでいる技術者による特別講演を行わない場合がある。 また、本講演は講演者の都合により日にちが変更となる場合がある。",
  "preparation": "C言語を用いた基本的なプログラミングが完璧に行えることを前提とする。 これは、条件文や繰り返し文、配列のみならず、構造体とポインタも含むものとする。 また、ビット演算については、C言語でのプログラミングだけでなく、2の補数や排他的論理和などの演算そのものの知識も必要とする。 Webの脆弱性についても扱うため、PHPとJavaScriptの知識も必須とする。 PHPについては、予約や受付を行う一般的なWebシステムを自力で構築できる程度の知識が必要である。 JavaScriptについては、HTMLのDOMプログラミングスキルが必要である。 以上のスキル及び知識については、授業開始までに必須とする。 予習として、次の回の授業で使用する技術について、Web等を使用して確認する。また、課題のプログラミングがある場合には、次回の授業時間までに行ってくる。 復習として、授業で扱った脆弱性について、実際にプログラミングして再確認する。",
  "evaluation": "レポートと、毎回の講義時間中における討論の記録を用いて成績評価を行う。 まず、レポートを基準とし成績を付ける。 討論は加点対象とせず、参加拒否1回につき1段階成績を下げる。 討論のフィードバックはその場で行う。レポートは、採点後に電子的にフィードバックを行う。",
  "textbook": "なし",
  "referenceMaterials": "なし",
  "schedulePlan": "第1回：受講者の知識確認とプログラミングにおけるセキュリティ問題の概説 第2回：ビット演算とその問題に関する解説および討論 第3回：演算による型変換とその問題に関する解説および討論 第4回：SQLインジェクション攻撃の脆弱性に関する解説および討論 第5回：XSS攻撃の脆弱性に関する解説および討論 第6回：データベース設計とWebシステムの問題点に関する解説および討論 第7回：脆弱性検出や対応の職務に取り組んでいる技術者による特別講演"
}