{
  "subjectName": "エルゴノミクスデザイン特論",
  "instructors": [
    "盛川浩志(メディア学部メディア学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGM14001",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "水",
      "period": 2
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ３０４",
  "lastUpdated": "2025/01/07",
  "overview": "人間工学（エルゴノミクス）に基づくデザインについて、実例の調査を通して学習する。ヒトの生理的、認知的な特性について理解を深め、モノやシステムのデザインに適用するための手法や評価方法などについて学ぶ。 人間工学は安全性や利便性を考えるうえで基礎となる知見を提供してくれる学問であり、その知見を学ぶことで様々なデザインへの応用が期待できる。この科目ではその人間工学に基づくデザイン手法の一端に触れ、メディアコンテンツデザインに対する視野を深めることを目指す。 In this lecture, you will learn about ergonomic design through examples. This lecture aims to deepen your understanding of the physiological and cognitive characteristics of humans, and will cover methods for applying ergonomics knowledge to the design of products and systems, as well as evaluation methods. Ergonomics is a field of study that provides the basic knowledge needed to consider safety and comfort, and learning this knowledge can be expected to have applications in various designs. In this topic we will touch on some of the design methods based on ergonomics and aim to deepen our perspective on the design of media content.",
  "objectives": "人間の生理的認知的特性の理解し、モノのデザイン、システムの設計、コンテンツの制作といった事例に応用できる知識を身に着けることを目標とする。また、人間工学的評価手法を学ぶことで、定量的な分析ができるようになることを期待する。 The aim is to understand the physiological and cognitive characteristics of humans and to acquire knowledge that can be applied to cases such as product design, system design and content production. It is also hoped that by learning about human engineering evaluation methods, students will be able to carry out quantitative analysis.",
  "teachingMethod": "講義、調査、発表を基本として授業を進める。授業資料は毎回教員が配布し、講義形式の説明を行ったのち、各自が調査をその発表を行う。また最終レポートを課し、全体の内容についての理解度の確認を行う。資料は日本語版と英語版を配布する。 情報の検索やデータの整理等を行うため、ノートPCを持参すること。 The course is taught through lectures, research and presentations. The teacher will distribute the course materials each time and after a lecture-style explanation, each student will conduct research and give a presentation. A final report will also be assigned to check the students' understanding of the overall content. Materials will be distributed in both Japanese and English. Students are required to bring their own notebook PC for searching information and organising data.",
  "notes": "受講者の人数に応じて課題発表形式を変更する可能性がある。その場合は授業内にて指示を行う。 The format of the assignment presentation may change depending on the number of students. In this case, instructions will be given in class.",
  "preparation": "授業で配布する資料を見直すことによる復習や、授業内で紹介する事例や参考文献の調査などの予習などが必要となる（それぞれ60分程度）。 Students will need to spend approximately 60 minutes each reviewing the materials distributed in class and preparing for class by researching the examples and references presented in class.",
  "evaluation": "各課題の発表において、講評によるフィードバックを行う。授業内での公表が時間的に困難な場合は、個別に講評結果をフィードバックする。 発表の内容（75%）と最終レポート（25%）の評価によって、100点満点中60点に達したものを合格とする。 Feedback will be given as comments on each presentation. If it is not possible to give feedback in class due to time constraints, feedback will be given individually. Students will be assessed on the content of their presentation (75%) and their final report (25%) and a mark of 60 out of 100 is required to pass.",
  "textbook": "授業内で資料を配布する。 Materials will be distributed in class.",
  "referenceMaterials": "「誰のためのデザイン？」D.A.ノーマン、新曜社 ほか、適宜紹介する。 \"The Design of Everyday Things\", Don Norman, Basic Books Other information will be introduced as appropriate.",
  "schedulePlan": "第1回：イントロダクション 第2回：人間の身体寸法 第3回：事例調査と発表（デザイン考案） 第4回：人間の知覚特性 第5回：事例調査と発表（メディア事例調査） 第6回：人間工学的評価と分析 第7回：事例調査と発表（先行研究調査と研究計画） Lesson 1: Introduction Lesson 2: Human body dimensions Lesson 3: Case study and presentation (Design ideas) Lesson 4: Human perceptual characteristics Lesson 5: Case study and presentation (Media case study) Lesson 6: Ergonomic evaluation and analysis Lesson 7: Case study and presentation (Preliminary research survey and research plan)"
}