{
  "subjectName": "演出デザイン特論",
  "instructors": [
    "兼松祥央(メディア学部メディア学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGM12501",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "水",
      "period": 5
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ３０４",
  "lastUpdated": "2025/03/21",
  "overview": "映像コンテンツ制作において演出は制作者が作品に込めたテーマを表現する手段であり，視聴者が作品から受ける印象を大きく左右する要素である．したがって，演出を考える際には制作者の意図を作品の内容にあわせてしっかりと設計しなければならない． 本授業では，映像制作の大きな柱であるシナリオとキャラクターが持つ情報を軸に，演出手法の分析と演出設計の実習を行う． 演出設計では特にライティング（照明）とカメラワークを扱い，ストーリーやキャラクターにあわせた「見せ方」の習得を目指す． In the production of video content, direction is a means of expressing the theme that the creator has put into the work, and it is an element that greatly influences the impression that the viewer receives from the work. Therefore, when considering direction, the creator's intentions must be carefully designed to match the content of the work. In this class, we will analyze directing methods and practice directing design, focusing on the information contained in the scenario and characters, which are the two main pillars of video production. In directing design, we will particularly focus on lighting and camera work, aiming to acquire the ability to “show” the story and characters in a way that suits them.",
  "objectives": "1.ストーリーやキャラクターの見せ方，演出手法に関する分析能力の習得 2.映像コンテンツの基礎的な企画能力と企画内容に合わせた演出設計方法の習得 1. Acquiring the ability to analyze storylines, character presentation, and production techniques 2. Acquiring the ability to plan basic video content and production design methods that match the content of the plan",
  "teachingMethod": "授業では既存作品における演出手法や映像制作に関する研究の解説を行う．また，各々で設定するテーマに沿った調査・分析や資料作成を行い，発表とフィードバックを行う． ノートPC必携． In class, we will explain research on production methods and video production in existing works. We will also conduct research and analysis and create materials based on the theme set by each student, and then give presentations and feedback. A laptop is required.",
  "notes": "既存作品分析を行うため，映像配信サービスやDVDレンタル，または図書館での視聴など，既存の映画作品を繰り返し視聴できる環境が必要です． windows環境でのみ動作するソフトウェアを用いる可能性があります． 授業時間以外に調査や課題を行う時間が必要です． 3DCGモデリングやアニメーションの制作経験があることが望ましい． In order to analyze existing works, you will need to be able to repeatedly watch existing films, such as through video distribution services, DVD rental, or at the library. There is a possibility that you will use software that only works on a Windows environment. You will need time outside of class hours to do research and assignments. It is desirable that you have experience in 3DCG modeling and animation production.",
  "preparation": "予習として授業内で案内する映像作品や、各自で選んだ映像コンテンツを視聴・調査（120分程度）が必要です。また、復習として講義のテーマに沿って作品分析を行い，発表資料の作成（120分程度）が必要になります As preparation, you will need to watch and research the video works that will be introduced in class, as well as video content that you have chosen yourself (about 120 minutes). As a review, you will also need to analyze works based on the theme of the lecture and prepare presentation materials (about 120 minutes).",
  "evaluation": "最終課題(60%)，授業内での発表(40%)によって成績評価を行い．100点満点中合計60点以上で単位認定する． また，授業内で実施する発表の際に，各々の調査・発表内容に対するディスカッションを参加者全員で行うとともに，教員からのフィードバックも行う． Grades will be assessed based on the final assignment (60%) and in-class presentations (40%). A total of 60 points out of 100 will be required to receive credit. In addition, during the in-class presentations, all participants will engage in discussions on the content of each survey and presentation, and the instructor will also provide feedback.",
  "textbook": "指定しない Not specified",
  "referenceMaterials": "三上 浩司、戀津 魁、近藤 邦雄、茂木 龍太、兼松 祥央：メディア学大系３コンテンツクリエーション（改訂版）、コロナ社",
  "schedulePlan": "第1回：ガイダンス:演出設計の概要 第2回：ストーリーとキャラクターの分析法 第3回：演出設計のためのリテラル資料制作 第4回：演出のテーマとコンセプト 第5回：ライティング（照明）とカメラワークの分析 第6回：演出設計と作品制作の実習 第7回：講義のまとめと制作結果発表 Session 1: Guidance: Overview of Mise-en-scène Design Session 2: Methods of Analyzing Story and Characters Session 3: Creating Literal Materials for Directing Design Session 4: Themes and Concepts of Mise-en-scène Session 5: Analyzing Lighting and Camera Work Session 6: Practicum in Mise-en-scène Design and Production Session 7: Summary of Lectures and Presentation of Production Results"
}