{
  "subjectName": "コンピュータビジュアリゼーション特論",
  "instructors": [
    "竹島由里子(メディア学部メディア学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGM13701",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "火",
      "period": 3
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "片柳研究所Ｅ３０２",
  "lastUpdated": "2025/03/11",
  "overview": "ビジュアリゼーション（可視化）は、数値データを図形に変換して視覚的に解析を可能にする技術です。大規模データや複雑な構造を持つデータから意味のある情報を抽出することは難しいですが、可視化により直感的に隠れた情報を発見することができます。ただし、可視化方法によって得られる情報量が異なるため、適切な可視化技法とパラメタ設定が必要です。 本授業では、科学技術データと情報可視化技法を体系的に学び、具体的な事例を通じて目的に応じた可視化技法を使いこなせる力を養います。 Computer visualization is a technique that enables visual analysis by converting numerical data into graphical representations. Extracting meaningful information from large or complex data can be challenging, but visualization allows for the intuitive discovery of hidden insights. However, the amount of information gained depends on how the data is visualized, so effectively selecting the proper technique and configuring parameters is essential. This course aims to study techniques for scientific visualization and information visualization systematically. Students will develop the ability to apply appropriate visualization methods based on the objectives of specific examples.",
  "objectives": "各可視化技法の利点や欠点、特性などを習得するとともに、具体的な事例での利用や可視化結果の理解が可能になるための知識を身につける。 Students will also learn the advantages, disadvantages, and characteristics of various visualization techniques. Additionally, they will acquire the knowledge needed to apply these techniques to specific cases and to interpret visualization results effectively.",
  "teachingMethod": "【授業形態：講義】ノートPC必携 スライドを用いて講義を行う。各可視化技法について説明するとともに、その可視化技法を用いた具体的な事例についても紹介していく。また、可視化結果から得られる情報について考察し、可視化方法の問題点や改善点などについての議論を行う。 また、情報可視化ソフトウェアTableauを用いた、演習を適宜行うことで、実データの可視化作業を体験する。 【Class Format: Lecture】 A laptop is required. Lectures will be conducted using slides. Each visualization technique will be explained, accompanied by concrete examples demonstrating its application. In addition, students will analyze the information obtained from visualization results and engage in discussions about the challenges and potential improvements of the visualization methods. Practical exercises using the data visualization software Tableau will also be conducted as needed, allowing students to experience hands-on visualization of real-world data.",
  "notes": "講義を「聴く」だけでなく、積極的に課題を行うようにすること。 Students are encouraged not only to listen to the lectures but also to actively engage in completing the assigned tasks.",
  "preparation": "学習した可視化技法に対して、どのようなデータで利用可能か、どのような工夫が可能かなどについて復習すること。 授業前に、その回で学ぶ内容の把握をすること（120分程度）。授業後に、キーワードの理解、演習内容の復習、レポート課題などを実施すること（120分程度）。 Students are expected to review the visualization techniques learned in class, including understanding what types of data each technique can be applied to and exploring possible innovations or improvements. Before each class session, students should preview the topics to be covered (approximately 120 minutes). After class, students are required to deepen their understanding by reviewing key concepts, revisiting exercise content, and completing report assignments or other tasks (approximately 120 minutes).",
  "evaluation": "各回で示す課題および最終課題を4:6の割合で換算し、全体の6割以上の成績で合格とする。なお、各回の課題は、次回の授業内でフィードバックを行う。 Assignments given in each session and the final project will be weighted at a ratio of 4:6. A total score of 60% or higher is required to pass the course. Feedback on the assignments from each session will be provided during the following class.",
  "textbook": "指定しない None",
  "referenceMaterials": "「Visualization Analysis &amp; Design」、CRC Press 「可視化と科学・文化・社会」、コロナ社 (in Japanese)",
  "schedulePlan": "第1回：イントロダクション（情報可視化の意義） 第2回：データおよびタスクの抽象化 第3回：記号とチャネル 第4回：可視化の規則 第5回：表データの可視化 第6回：空間データの可視化 第7回：まとめ（適用事例紹介） Session 1: Introduction (Significance of Information Visualization) Session 2: Abstraction of Data and Tasks Session 3: Marks and Channels Session 4: Rules of Visualization Session 5: Visualization of Tabular Data Session 6: Visualization of Spatial Data Session 7: Summary (Introduction to Application Examples)"
}