{
  "subjectName": "Video Journalism Studies",
  "instructors": [
    "森川美幸(メディア学部メディア学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGM82101",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "木",
      "period": 3
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "講義実験棟３０５",
  "lastUpdated": "2025/03/12",
  "overview": "In recent years, there have been increasing opportunities to see documentaries with the proliferation of video streaming services. Like news reports, many documentaries cover social issues. Unlike news reports, however, the messages of journalists or filmmakers are strongly expressed in documentaries. In this class, students will watch highly acclaimed documentary films and consider the impact of these works on society, as well as the possibilities for the future of video journalism. 近年、動画配信サービスの普及に伴い、ドキュメンタリー作品を目にする機会が増えた。ニュース報道と同じように、ドキュメンタリーは社会問題を取り上げる。しかし、ニュース報道と違い、ドキュメンタリーにはジャーナリストや制作者のメッセージが色濃く表れる。本講義では高く評価されたドキュメンタリー映画を鑑賞し、作品が社会に及ぼした影響を考察すると共に、これからの映像ジャーナリズムの可能性を考える。",
  "objectives": "Through writing reports on highly acclaimed documentary films, students aim to gain the following skills. ✓ Deep insights into the theme ✓ Original and unique perspectives ✓ Application of newly acquired knowledge ✓ Understanding of documentary films as cultural and social capital ✓ Logical text development 評価されているドキュメンタリー映画に関するレポート作成を通し、以下のスキル獲得を目指す。 ・テーマに対する深い洞察 ・独創的でユニークな視点 ・新しく得た知識の応用 ・文化的・社会的資本としてのドキュメンタリー映画の理解 ・論理的な文章展開",
  "teachingMethod": "This course is conducted as lectures for English language programmes. Each session, students watch a documentary film in English or with English subtitles and are assigned a report (in English) on a set theme. Laptops are not used in class. 英語プログラム用の講義として英語で実施。毎回英語または英語字幕付きのドキュメンタリー映画を鑑賞し、設定したテーマについてのレポート（英語）を課す。授業内でノートPCは使用しない。",
  "notes": "The use of generative AI is prohibited in this course. 本講義では生成AIの利用は禁止とする。",
  "preparation": "Watch excellent documentary films and documentary programmes from around the world on a regular basis and consider the implications and value of the work. Preparation and review time should be approximately 120 minutes in total. 普段から世界中の優れたドキュメンタリー映画やドキュメンタリー番組を鑑賞し、その作品の意味や価値を考えてみること。 予習・復習時間は計120分を目安とする。",
  "evaluation": "Reports (100%): Students are required to get at least 60 points of the total score out of 100 points for course credit approval. Feedback on reports will be given in class as appropriate. 毎回のレポート（100%）: 100点満点中60点を単位認定基準とする。 レポートへのフィードバックは、授業内で適宜行う。",
  "textbook": "N/A 指定しない。",
  "schedulePlan": "Session1: Introduction/ Free solo #1 (Documentary, Risks of filming) Session2: Free solo #2 (Capturing the subject's life, Preparation) Session3: Bowling for Columbine #1 (Methods of reporting, Sense of justice) Session4: Bowling for Columbine #2 (The value of documentaries, Interviews) Session5: Born into Brothels: Calcutta's Red Light Kids (Impact on subjects' lives, Journalistic photography) Session6: A #1 (The mission of journalism, Media criticism) Session7: A #2 (Close-up reporting, Neutral attitude) 第1回: イントロダクション／フリーソロ #1（ドキュメンタリーとは、撮影のリスク） 第2回: フリーソロ #2（取材対象の人生を捉える、準備） 第3回: ボウリング・フォー・コロンバイン#1（取材方法、正義感） 第4回: ボウリング・フォー・コロンバイン#2（ドキュメンタリーの価値、インタビュー） 第5回: 未来を写した子どもたち （取材対象に与える影響、報道写真） 第6回: A #1（ジャーナリズムの使命、メディア批判） 第7回: A #2（密着取材、中立的姿勢）"
}