{
  "subjectName": "Japanese Culture and Its Impact on Contemporary Content",
  "instructors": [
    "太田高志(メディア学部メディア学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "講義科目",
  "timetableCode": "GGM82201",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "月",
      "period": 4
    }
  ],
  "department": [
    "バイオ・情報メディア研究科博士前期課程メディアサイエンス専攻"
  ],
  "grade": [
    1,
    2
  ],
  "credits": 1,
  "classroom": "講義実験棟２０７",
  "lastUpdated": "2025/03/13",
  "overview": "Japanese contemporary content such as manga, anime, and video games is regarded as unique and enjoys widespread popularity around the world. Influences from traditional Japanese culture can be observed throughout these modern works, contributing to their distinctive nature. This uniqueness stems, in part, from Japan’s historically isolated environment, which has fostered the development of unique concepts and perspectives. In this course, we adopt several different points of view to examine the impact of traditional culture on contemporary works. By exploring the various aspects of these influences, the course aims to uncover the roots of the uniqueness found in Japanese modern content and seeks to identify insights that can be applied to the creation of new works.",
  "objectives": "This course does not focus on memorizing knowledge. Instead, students are expected to develop a perspective for analyzing and contemplating unique content design. The following insights are the key learning objectives for students: 1. Gain an understanding of traditional Japanese arts such as Kabuki, Noh, and Ukiyo-e, as well as concepts like wabi-sabi. 2. Explore the influence of these traditional elements on contemporary content such as manga, anime, and the concept of kawaii. 3. Examine the core ideas underlying Japanese content creation. By acquiring these skills, students will develop the ability to analyze and evaluate contemporary Japanese content and generate original content ideas.",
  "teachingMethod": "The class is conducted in seminar style, with analysis and discussion of various case studies forming the core of the course. Each week, students are assigned a research theme, and are required to give a presentation on it in class. After the presentation, a group discussion is held on the content. Students are required to bring their own laptop computers to the presentations of their own assignments.",
  "notes": "This class is part of the English program and is conducted entirely in English. Students are expected to participate in discussions in English as well. Japanese students may enroll in this course if they are able to meet this requirement.",
  "preparation": "Students are given a research assignment on a specific topic each time. They are required to prepare slides so that they can present their findings in the form of a presentation (about 120 min. for preparation).",
  "evaluation": "The grade will be based on the quality of the student's work on the assignment (50%: slide quality and content of presentation) and the quality of the student's participation in class discussions (50%). A score of 60 or above is considered passing. Feedback on the assignment will be given in class after the students have presented their work.",
  "textbook": "no textbook is specified.",
  "referenceMaterials": "日本文化の核心（in Japanese)、松岡正剛、講談社現代新書",
  "schedulePlan": "第1回：Overview of Japanese culture 第2回：Borrowing of styles 第3回：Simplicity 第4回：Ukiyo-e and its influence 第5回：Kawaii and Wabi-Sabi 第6回：Ideas of Japanese modern contents 第7回：The root of the uniqueness"
}