{
  "subjectName": "Integrated English II[1]MS火1",
  "instructors": [
    "小林素羅(兼任講師)"
  ],
  "courseCategory": "実学基礎科目",
  "courseType": "演習科目",
  "timetableCode": "L606M01",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "火",
      "period": 1
    }
  ],
  "department": [
    "メディア学部メディア学科"
  ],
  "grade": [
    2,
    3,
    4
  ],
  "credits": 1,
  "classroom": "講義棟Ａ２０１",
  "lastUpdated": "2025/01/20",
  "overview": "Integrated English Iの内容をレベルアップし、より実践的な英語力の向上を目的とする。Integrated English Iと同様に、学生の興味・関心や進路に即した内容を学習することを通じて英語の4技能のスキルアップや国際的教養、ビジネス英語のさらなる修得をめざす。 教科書内の英文に加えて授業のテーマ(Current Affairs)に関連する新聞記事等を紹介します。記事を題材に読解および要約のための言語活動により総合的な言語運用能力向上をはかります。 TOEIC600点への到達を目指して授業を行う。 この科目は前・後期続けて履修することを推奨する。",
  "objectives": "１．語彙力を強化する。 ２．具体的な事象に関して自らの考えを加えながら説明できる。 ３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。 ４．グローバル時代に必要な国際的な教養力を身につける。",
  "teachingMethod": "In the classroom we will focus on listening and speaking activities, while homework and assignments will give students a chance to develop their reading and writing skills. Classroom activities will be based on the current affairs-related material in the textbook. We will be adopting an 'active learning' approach in this class,and students will be asked to work individually, in pairs or in groups. For the reading/writing homework, more recent news articles will be selected by the teacher. New vocabulary will be learned and old vocabulary reviewed. Grammar will be revised when necessary. Feedback will be given for all class activities, either orally or in written format (ex. via Moodle). PCs are a must!",
  "notes": "Have the textbook with you for every class. A good dictionary will be useful. Please take notes during the class, and participate actively by taking part in all activities and asking questions when you do not understand something. この科目は前・後期続けて履修することをおすすめします。",
  "preparation": "予習（120分程度）： 各ユニットの語彙、文法事項を授業前に確認してください。 授業中にVocabulary Check及びGrammar Check を適宜実施します。 復習（120分程度）： 既習の語彙、文法事項を授業後に確認してください。",
  "evaluation": "「授業参加姿勢 (30%)」「課題点 (30％)」「到達度チェック (40％)」を総合的に評価する。合格点は60％とする。 授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。 課題に対するフィードバックは授業時間内、あるいはMoodleなどを通じて随時行う。",
  "textbook": "Stephanie Diamond-Bayir, Kimberley Russell, and Chris Sowton; Unlock Second Edition Listening, Speaking &amp; Critical Thinking - Level 2 (Student's Book with Digital Pack); Cambridge University Press; ISBN-13 978-1009031462;&nbsp;&nbsp;3630円 w/tax",
  "referenceMaterials": "References will be provided in lessons when necessary.",
  "schedulePlan": "第1回：&nbsp;&nbsp;Re-orientation,Unit 5 Sports and Competition 第2回：&nbsp;&nbsp;Unit 5 - Sports and Competition 第3回：&nbsp;&nbsp;Unit 5 - Sports and Competition 第4回：&nbsp;&nbsp;Unit 6 - Business 第5回：&nbsp;&nbsp;Unit 6 - Business 第6回：&nbsp;&nbsp;Unit 6 - Business 第7回：&nbsp;&nbsp;Mid-course Review 第8回：&nbsp;&nbsp;Unit 7 - People 第9回：&nbsp;&nbsp;Unit 7 - People 第10回： Unit 7 - People 第11回： Unit 8 - The Universe 第12回： Unit 8 - The Universe 第13回： Unit 8 - The Universe 第14回： Final Achievement Check"
}