{
  "subjectName": "Advanced English I[金1]MS",
  "instructors": [
    "ブロックルバンク(教養学環)"
  ],
  "courseCategory": "実学基礎科目",
  "courseType": "演習科目",
  "timetableCode": "L607M02",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "金",
      "period": 1
    }
  ],
  "department": [
    "メディア学部メディア学科"
  ],
  "grade": [
    2,
    3,
    4
  ],
  "credits": 1,
  "classroom": "講義実験棟３０２",
  "lastUpdated": "2025/01/22",
  "overview": "この授業は、講義の聞き取りやプレゼンテーションに重点を置いた、学術的な英語力の向上を目指す上級レベルの授業である。また、学術的な語彙の知識も深めることも目指す。授業で扱う内容は、社会学、言語学、教育学など、さまざまな分野にわたる。TOEICテスト600以上の取得を目指す。この授業を履修するには、エントリーテストを受け、合格することが必須である。 Students who join this course are also asked to join the second part of this course starting in September.",
  "objectives": "The course has the following aims: (1) To develop students' knowledge and skills in Academic English at a higher, intermediate level (2) To expose students to intensive listening practice, typically lectures (3) To extend students' knowledge of academic vocabulary (4) To give the students practice in pronunciation",
  "teachingMethod": "With one subject being covered over two weeks, lessons will typically contain an introduction to the topic, a focus on related vocabulary, viewing of lectures, pronunciation practice,&nbsp;&nbsp;group discussions, and the development of note-taking skills. Notebook computers are essential.",
  "notes": "Have the textbook with you for every class. Use a good dictionary. Please take notes during the class, participate actively by taking part in all activities, and asking questions when you do not understand something.",
  "preparation": "Students will be given regular homework assignments and will be expected to complete self-study in order to review and prepare for classes (for example, by doing vocabulary research). This will normally amount to 60 minutes per week.",
  "evaluation": "「授業参加姿勢 (30%)」「課題点 (30％)」「到達度チェック (40％)」を総合的に評価する。合格点は60％とする。 授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。 課題に関するフィードバックは、口頭、オンライン掲示、または紙上のいずれかで学生に提供される。",
  "textbook": "Ellen Kisslinger; Contemporary Topics 2; Pearson; 978-0-13-440080-8; 3696円",
  "referenceMaterials": "None",
  "schedulePlan": "第2回：Unit 1 Sociology 第3回：Unit 1 Sociology 第4回：Unit 2 Linguistics 第5回：Unit 2 Linguistics 第6回：Unit 3 Psychology 第7回：Unit 3 Psychology 第8回：Unit 4 Business 第9回：Unit 4 Business 第10回：Unit 5 Education 第11回：Unit 5 Education 第12回：Unit 6 History 第13回：Unit 6 History 第14回：到達度確認チェック、後期のまとめ"
}