{
  "subjectName": "Advanced English II[火1]MS",
  "instructors": [
    "ブロックルバンク(教養学環)"
  ],
  "courseCategory": "実学基礎科目",
  "courseType": "演習科目",
  "timetableCode": "L608M01",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "火",
      "period": 1
    }
  ],
  "department": [
    "メディア学部メディア学科"
  ],
  "grade": [
    2,
    3,
    4
  ],
  "credits": 1,
  "classroom": "講義実験棟３０４",
  "lastUpdated": "2025/01/21",
  "overview": "Advanced English Iに引き続き、学術的な英語力をさらに伸ばすことを目的とした授業である。前期授業で得た専門知識を基に、より複雑なプレゼンテーションを行うことが求められる。学術的な語彙の学習も継続して行う。授業で扱う内容は、建築学、社会心理学、行政学など、さまざまな分野にわたる。前期に引き続きTOEICテスト650点以上を目指す。この授業を履修するには、エントリーテストを受け、合格することが必須である。",
  "objectives": "The course has the following aims: (1) To develop students' knowledge and skills in Academic English at a higher, intermediate level (2) To expose students to intensive listening practice, typically lectures (3) To extend students' knowledge of academic vocabulary (4) To give the students practice in pronunciation",
  "teachingMethod": "With one subject being covered over two weeks, lessons will typically contain an introduction to the topic, a focus on related vocabulary, viewing of lectures, pronunciation practice,&nbsp;&nbsp;group discussions, and the development of note-taking skills. Notebook computers are essential.",
  "notes": "Have the textbook with you for every class. Use a good dictionary. Please take notes during the class, participate actively by taking part in all activities, and asking questions when you do not understand something.",
  "preparation": "Students will be given regular homework assignments and will be expected to complete self-study in order to review and prepare for classes (for example, by doing vocabulary research). This will normally amount to 60 minutes per week.",
  "evaluation": "「授業参加姿勢 (30%)」「課題点 (30％)」「到達度チェック (40％)」を総合的に評価する。合格点は60％とする。 授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。 課題に関するフィードバックは、口頭、オンライン掲示、または紙上のいずれかで学生に提供される。",
  "textbook": "Ellen Kisslinger; Contemporary Topics 2; Pearson; 978-0-13-440080-8; 3696円",
  "referenceMaterials": "None",
  "schedulePlan": "第1回：Course orientation 第2回：Unit 7 Social Psychology 第3回：Unit 7 Social Psychology 第4回：Unit 8 Architecture 第5回：Unit 8 Architecture 第6回：Unit 9 Public Health 第7回：Unit 9 Public Health 第8回：Unit 10 Urban Planning 第9回：Unit 10 Urban Planning 第10回：Unit 11 Biology 第11回：Unit 11 Biology 第12回：Unit 12 Public Administration 第13回：Unit 12 Public Administration 第14回：到達度確認チェック、後期のまとめ"
}