{
  "subjectName": "Integrated English III[A1]MS",
  "instructors": [
    "ミンドグA(兼任講師)"
  ],
  "courseCategory": "教養教育科目",
  "courseType": "演習科目",
  "timetableCode": "L620M01",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "水",
      "period": 1
    }
  ],
  "department": [
    "メディア学部メディア学科"
  ],
  "grade": [
    3,
    4
  ],
  "credits": 1,
  "classroom": "講義棟Ａ２０４",
  "lastUpdated": "2025/01/15",
  "overview": "英語の総合的な実践的運用能力をさらに向上させることを目指す。Integrated English I・IIと同様に、学生の興味・関心や進路に即した内容を扱うが、より専門性や時事性の高い英語の学びを通じて、ディスカッションやプレゼンテーションを含む4技能のスキルアップ、論理的思考力や分析力の向上をめざす。将来のキャリアにおける英語使用、大学院進学に対応した英語学習など、将来、自発的に英語を学習できるような方法論と動機付けも与える。 In this class, we will use learning materials to inform us about news and current affairs around the world. この授業では、TOEIC 500-600レベルの到達を目指す。 なお、この科目は前・後期続けて履修することをすすめる。",
  "objectives": "１．語彙力を強化する。 ２．具体的、抽象的な事柄に関して自らの考えを論理的に組み立て、述べたり書いたりできる。 ３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。 ４．グローバル時代に必要な国際的な教養力を身につける。",
  "teachingMethod": "We will watch, read and listen to various news stories in English. You will learn many new items of vocabulary, too. After most units, you will work in pairs or groups for discussions, research and short presentations. Feedback will be given orally, and scores written on a piece of paper. In addition, as assignments, you will select news articles from https://edition.cnn.com/ to share in class. Feedback on this will be provided via Moodle. With regard to quizzes, they are returned to students after checking. A PC is needed for the short presentations and assignments.",
  "notes": "We will be using the textbook in each class, so be sure to always bring it. Also, bring a dictionary to look up the meanings of words you do not know. Lastly, bring a laptop computer to prepare for the short presentations, as well as to access the CNN website.",
  "preparation": "Read each unit in advance. Look up the meanings of unknown words. There is no need to answer the questions. Preparation for short presentations should be done at home (15 minutes). Before coming to class, check the CNN website for news articles you will share with your classmates (15 minutes). After each lesson, make sure you review important points (30 minutes).",
  "evaluation": "「授業参加姿勢 (30%)」「課題点 (30％)」「到達度チェック (40％)」を総合的に評価する。合格点は60％とする。 授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。 課題に対するフィードバックは授業時間内、あるいはMoodleなどを通じて随時行う。",
  "textbook": "Fuyuhiko Sekido, Masato Kogure, Jake Arnold, Christopher Mattson著; CNN 10 Student News, Vol.13; ASAHI PRESS; ISBN978-4-255-15727-6; 2420円",
  "referenceMaterials": "なし",
  "schedulePlan": "第1回 授業についてのガイダンス 第2回 Unit 1 第3回 Unit 2 第4回 Group Presentation 1 &amp; 課題 1: Sharing News 第5回 Unit 3 第6回 Group Presentation 2 &amp; 課題 2: Sharing News 第7回 Unit 4 第8回 Group Presentation 3 &amp; 課題 3: Sharing News 第9回 Unit 5 第10回 Group Presentation 4 &amp; Quiz 1 第11回 Unit 6 第12回 Group Presentation 5 &amp; Quiz 2 第13回 Unit 7 第14回 到達度チェック・まとめ"
}