{
  "subjectName": "Integrated English III[10]CS機械",
  "instructors": [
    "尾関浩司(兼任講師)"
  ],
  "courseCategory": "教養教育科目",
  "courseType": "演習科目",
  "timetableCode": "L620C10",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "木",
      "period": 1
    }
  ],
  "department": [
    "コンピュータサイエンス学部コンピュータサイエンス学科",
    "工学部機械工学科"
  ],
  "grade": [
    3,
    4
  ],
  "credits": 1,
  "classroom": "講義実験棟３０２",
  "lastUpdated": "2025/01/28",
  "overview": "英語の総合的な実践的運用能力をさらに向上させることを目指す。Integrated English I・IIと同様に、学生の興味・関心や進路に即した内容を扱うが、より専門性や時事性の高い英語の学びを通じて、ディスカッションやプレゼンテーションを含む4技能のスキルアップ、論理的思考力や分析力の向上をめざす。将来のキャリアにおける英語使用、大学院進学に対応した英語学習など、将来、自発的に英語を学習できるような方法論と動機付けも与える。この授業では、TOEIC 500-600レベルの到達を目指す。TOEICで頻出する内容、語彙等に加え、英語学習の基本（単語、熟語、文法、英文解釈等）も授業に取り入れていく。ペアワークやグループワークを取り入れ授業を行う。それと同時に各個人の英語学習の目標、ニーズに対応して、到達方法、何をどのくらいやれば目的地にたどり着けるかを具体的にアドバイスする。 この科目は前・後期続けて履修することをすすめる。",
  "objectives": "１．語彙力を強化する。 ２．具体的、抽象的な事柄に関して自らの考えを論理的に組み立て、述べたり書いたりできる。 ３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。 ４．グローバル時代に必要な国際的な教養を身につける。",
  "teachingMethod": "毎回の授業で基本的に教科書の1つのユニットに取り組む。補助教材（プリント等）も随時必要に応じて使用していく。特に英語の基本事項に関して重点的に行う。ノートＰＣ等は指示があるときのみ使用する。小テスト、もしくは授業時間内で行う課題やアクティビティーや14回ある。ペアワーク、グループワークを行う。小テストや課題へのフィードバックは授業内で随時行う。",
  "notes": "毎回の授業では、教科書の問題を解くので、教科書を必ず持ってくること。欠席が著しく多い場合は成績に影響する。",
  "preparation": "毎回の語彙テストの準備を行い（30分程度）、授業後に指定された課題（教科書・プリント）に取り組む（30分程度）。",
  "evaluation": "「授業参加姿勢 (30%)」「課題点 (30％)」「到達度チェック (40％)」を総合的に評価する。合格点は60％とする。授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。 課題に対するフィードバックは授業時間内、あるいはMoodleなどを通じて随時行う。",
  "textbook": "鈴木淳 / 高橋哲徳 / 高橋史朗 / Simon Cooke 共著&nbsp;&nbsp;DEVELOP GRAMMATICAL COMPETENCE FOR THE TOEICⓇ L&amp;R TEST/TOEICⓇ L&amp;Rテスト文法項目別トレーニング 松柏社 ISBN 978-4-88198-758-2 1,900円（税別）",
  "referenceMaterials": "TEX加藤著; TOEIC L&amp;R 出る単特急 金のフレーズ; 朝日出版社; ISBN9784023315686 （本体890円+税） その他必要に応じて授業内で紹介する",
  "schedulePlan": "第1回：ガイダンス,1 品詞 小テスト又はクラス内課題① 第2回： 2 時制 小テスト又はクラス内課題② 第3回： 3 受動態 小テスト又はクラス内課題③ 第4回： 4 不定詞・動名詞&nbsp;&nbsp;小テスト又はクラス内課題④ 第5回： 5 分詞 小テスト又はクラス内課題⑤ 第6回： 6 前置詞・接続詞 小テスト又はクラス内課題⑥ 第7回： 7 関係詞 小テスト又はクラス内課題⑦ 第8回： 8 仮定法 小テスト又はクラス内課題⑧ 第9回： 9 語彙問題1 形容詞・副詞 小テスト又はクラス内課題⑨ 第10回：10 イディオム問題1 小テスト又はクラス内課題⑩ 第11回：11 語彙問題2 動詞・名詞 小テスト又はクラス内課題⑪ 第12回：12 イディオム問題2 小テスト又はクラス内課題⑫ 第13回：13 基礎力確認テスト 小テスト又はクラス内課題⑬ 第14回：14＆15実力テスト補強問題 小テスト又はクラス内課題⑭"
}