{
  "subjectName": "Integrated English III[1]BS電電応化",
  "instructors": [
    "ブロックルバンク(教養学環)"
  ],
  "courseCategory": "教養教育科目",
  "courseType": "演習科目",
  "timetableCode": "L620B01",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "月",
      "period": 1
    }
  ],
  "department": [
    "応用生物学部応用生物学科",
    "工学部電気電子工学科",
    "工学部応用化学科"
  ],
  "grade": [
    3,
    4
  ],
  "credits": 1,
  "classroom": "講義実験棟３０５",
  "lastUpdated": "2025/01/21",
  "overview": "英語の総合的な実践的運用能力をさらに向上させることを目指す。Integrated English I・IIと同様に、学生の興味・関心や進路に即した内容を扱うが、より専門性や時事性の高い英語の学びを通じて、ディスカッションやプレゼンテーションを含む4技能のスキルアップ、論理的思考力や分析力の向上をめざす。将来のキャリアにおける英語使用、大学院進学に対応した英語学習など、将来、自発的に英語を学習できるような方法論と動機付けも与える。 The theme of this course is CURRENT AFFAIRS. This is the first part of a year-long course. Therefore, it is recommended that students take both Integrated English III[1] and Integrated English IV[1].The aim is for students to reach a level equivalent to 450-550 in the TOEIC test.",
  "objectives": "１．語彙力を強化する。 ２．具体的、抽象的な事柄に関して自らの考えを論理的に組み立て、述べたり書いたりできる。 ３．批評的思考（クリティカルシンキング）によって、分析・評価ができる。 ４．グローバル時代に必要な国際的な教養力を身につける。",
  "teachingMethod": "In this course we will cover the four skills, but the main focus will be on developing students' reading ability. In the reading part of the course, we will look at the news-related topics covered in the textbook and a range of other texts selected by the teacher. The writing exercises will be related to the content of the reading that students will have done. New vocabulary will be learned and old vocabulary reviewed. We will be adopting an 'active learning' approach in this class, and there will be opportunities for students to exchange opinions on the various topics through pair/group work. Occasionally, there will be a news-related video to watch. Feedback will be given for all class activities, either orally or in written format (ex. via Moodle). PCs are a must!",
  "notes": "Have the textbook with you for every class. Access to a good online dictionary will be useful. Please take notes during the class, and participate actively by taking part in all activities and asking questions when you do not understand something.",
  "preparation": "Please review the classes that you have completed and prepare for the ones to come. You will be expected to learn the key vocabulary, and there will be several mini-tests to see if you have done this. The learning of vocabulary should take around 30 minutes. Please also allow 30 minutes for the review and preview of the unit content.",
  "evaluation": "「授業参加姿勢 (30%)」「課題点 (30％)」「到達度チェック (40％)」を総合的に評価する。合格点は60％とする。 授業参加姿勢とは、積極的な発言、質問、グループワークやペアワーク等授業内活動に取り組む姿勢や予習・復習状況確認のために実施する小テストの結果に関する評価を含む。 課題に関するフィードバックは、口頭、オンライン掲示、または紙上のいずれかで学生に提供される。",
  "textbook": "Sandra Heyer; True Stories 4; Pearson Education; ISBN-13 978-0137598830;&nbsp;&nbsp;3223円",
  "referenceMaterials": "References will be provided in lessons when necessary.",
  "schedulePlan": "第1回： Orientation 第2回： Unit 1 - Love at First Sight 第3回： Unit 1 - Love at First Sight 第4回： Unit 2 - The Semong (The Tsunami) 第5回： Unit 3 - More Alike Than Different 第6回： Unit 3 - More Alike Than Different 第7回： Unit 4 - Healthy Again 第8回： Unit 5 - If You Have Time 第9回： Unit 5 - If You Have Time 第10回： Unit 6 - The Buried City 第11回： Unit 7 - Misunderstandings 第12回： Unit 7 - Misunderstandings 第13回： Unit 8 - A Real Bargain 第14回： Final Achievement Check"
}