{
  "subjectName": "フレッシュマンイングリッシュII[デザイン11]",
  "instructors": [
    "勝浦寿美(教養学環)"
  ],
  "courseCategory": "実学基礎科目",
  "courseType": "演習科目",
  "timetableCode": "R109B",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "月",
      "period": 4
    },
    {
      "day": "木",
      "period": 1
    }
  ],
  "department": [
    "デザイン学部デザイン学科"
  ],
  "grade": [
    1,
    2,
    3,
    4
  ],
  "credits": 2,
  "classroom": "３０３１１教室",
  "lastUpdated": "2025/01/20",
  "overview": "身近な話題に関する英語の語彙や表現を学修し定着させる。また、世界の文化や慣習を知る。英語の知識を４つの技能「聞く」「話す」「読む」「書く」に応用する実践的な練習を行い、英語のコミュニケーション能力を向上させる。ペアワークやグループワークで協働学修を行う。インタビューなどで得た情報や、与えられた情報に関して、互いに考えを出し合って、分析や評価を行い、問題解決の方法について話し合う機会を持つ。さらに、論理的に要点を説明する能力を育むために、英語によるプレゼンテーションの基礎を学ぶ。",
  "objectives": "1．フレッシュマンイングリッシュⅠに引き続き、身近な話題に関して、英語を用いてコミュニケーションをとることに対して臆せずに自分の意志や意見を伝えようとする態度をもつ。 2．相手の話していることが聞きとれない場合でも、躊躇せずに聞き返したり、わからないという意志表示ができる。 3．グローバルな社会において、異なる文化や生活習慣、考え方に関心をもち、多様性を尊重できる。 4.多少の複雑な内容については、これまでの経験や知識を駆使して想像力を働かせて理解する姿勢を身につける。自分の表現したいことを論理的に相手に分かりやすくプレゼンテーションできる。",
  "teachingMethod": "授業への参加と宿題への取り組みが必要。授業は教科書や補助教材を使い、基本的に英語で行われ、会話練習にはペアワークやグループワークを多く取り入れる。日本語による私語は厳禁である。学生には、授業への英語による積極的な参加を求め、学生自らの主体的な学び（アクティブラーニング）を促す。 授業内では、基本的にはノートPCは利用しないが、予め指示があった場合は、ノートPCやイヤフォン・ヘッドフォンを持参し、利用のこと。 ※授業はキャンパスで実施予定であるが、感染症拡大など社会状況に応じて、双方向型授業(オンラインライブレッスン)の形態に変更する可能性有り。",
  "notes": "・指定されたクラスで授業に参加すること。 ・各学期、週に2回、同じクラスで授業があるので、両方出席すること。 ・宿題は期限内に提出すること。 ・遅刻・欠席は厳禁。 ・配慮検討の対象を満たす欠席の場合は、その証明となるものを添付し欠席届を提出のこと。 (詳細は、授業初回にて説明予定)。",
  "preparation": "課された宿題を実施(30分程度)した上で授業に臨むこと(英作文なども含む。授業ではその振り返りや応用する実践的な練習を行う)。次回の授業に備え、授業中は学んだ英語表現をノートに記録し、授業後に復習すること（30分程度）。授業で学んだ語彙や表現を実際に使い、積極的に英語を使うこと。",
  "evaluation": "毎回の授業への積極的な取り組みや宿題の提出などを含め、次の２つの項目について総合的に評価する。 1)英語能力 (English Competency) =40% (内Presentation=10%) 2)授業への参加態度 (Learning Attitude, assignments) =60% 課題に関するフィードバックは、Campus English site上、口頭、または紙上のいずれかで学生に提供される。",
  "textbook": "English Firsthand 1 (5th Edition) Student Book with MyMobileWorld (Pearson)",
  "referenceMaterials": "必要に応じて授業内で紹介する。",
  "schedulePlan": "第1週: 前期の復習および後期の目標 第2週: Unit 7 職業、就職面接 第3週: Unit 8 娯楽、招待 第4週: Unit 9 将来の計画 第5週: Unit 9 未来の予測 第6週: Unit 10 買い物 第7週: 復習、学修理解度の確認 第8週: 異文化理解 第9週: Unit 11 料理 第10週: Unit 11 順序 第11週: Presentation Skillsを学ぶ / Unit 12 音楽 第12週: Presentation Skillsの練習 (1) 第13週: Presentation Skillsの練習 (2) 第14週: Presentation 発表 第15週: 学期末の復習、到達目標の振り返り"
}