{
  "subjectName": "英語インテンシブIV[デザイン]",
  "instructors": [
    "勝浦寿美(教養学環)"
  ],
  "courseCategory": "教養教育科目",
  "courseType": "演習科目",
  "timetableCode": "R3020",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "火",
      "period": 3
    }
  ],
  "department": [
    "デザイン学部デザイン学科"
  ],
  "grade": [
    3,
    4
  ],
  "credits": 1,
  "classroom": "３０３１１教室",
  "lastUpdated": "2025/01/28",
  "overview": "1・2年次に学んだ英語の知識や能力のさらなる定着を図る。また、世界の文化や慣習について学ぶ。今まで学んだ英語の知識を活用し、与えられた話題(未来の建築、宇宙探査、コミュニケーションなど)に関する自分の意見や考えを根拠や理由を基に、より明確に説明できるための練習を行う。問題解決に向けて多様な考えに触れながら、クリティカルシンキング力を高め、ペアワーク・グループワークなどの協働学修を行う。与えられた情報やインタビューによって収集した情報を、共に分析・評価する。さらに、英語でのプレゼンテーションにおいて、説得力を高めるための効果的なテクニックや英語表現を習得する。",
  "objectives": "1．英語インテンシブⅢに引き続き、身近な話題に関して、英語を用いてコミュニケーションをとることに対して臆せずに自分の意志や意見を伝えようとする態度をもつ。 2．相手の話していることが聞きとれない場合でも、躊躇せずに聞き返したり、わからないという意志表示ができる。 3．グローバルな社会において、異なる文化や生活習慣、考え方に関心をもち、多様性を尊重できる。 4.多少の複雑な内容については、これまでの経験や知識を駆使して想像力を働かせて理解する姿勢を身につける。自分の表現したいことを論理的に相手に分かりやすくプレゼンテーションできる。",
  "teachingMethod": "授業への参加と宿題への取り組みが必要。授業は教科書や補助教材を使い、英語を母語とするネイティブ講師により基本的に英語で行われ、会話練習にはペアワークやグループワークを多く取り入れる。日本語による私語は厳禁である。学生には、授業への英語による積極的な参加を求め、学生自らの主体的な学び（アクティブラーニング）を促す。 授業内では、基本的にはノートPCは利用しないが、予め指示があった場合は、ノートPCやイヤフォン・ヘッドフォンを持参し、利用のこと。",
  "notes": "・基礎的な英語の知識を応用し、英語力を一層高めることを目的とするため、「フレッシュマンイングリッシュⅠ・Ⅱ」、「英語インテンシブⅠ・Ⅱ」の単位を既に修得していること。 ・前期と後期を通して完結する科目であるため、通年で履修することが望ましい。 ・宿題は期限内に提出すること。 ・配慮検討の対象を満たす欠席の場合は、その証明となるものを添付し欠席届を提出のこと。 (詳細は、授業初回にて説明予定)。",
  "preparation": "課された宿題を実施(30分程度)した上で授業に臨むこと(英作文なども含む。授業ではその振り返りや応用する実践的な練習を行う)。次回の授業に備え、授業中は学んだ英語表現をノートに記録し、授業後に復習すること（30分程度）。授業で学んだ語彙や表現を実際に使い、積極的に英語を使うこと。",
  "evaluation": "毎回の授業への積極的な取り組みや宿題の提出などを含め、次の２つの項目について総合的に評価する。 1)英語能力 (English Competency) =40% (内Presentation=20%) 2)授業への参加態度 (Learning Attitude, assignments) =60% 課題に関するフィードバックは、Campus English site上、口頭、または紙上のいずれかで学生に提供される。",
  "textbook": "Pathways: Listening, Speaking, and Critical Thinking, Second Edition Book 1, Student Book with Online Workbook Access Code; National Geographic Learning (Cengage Learning)",
  "referenceMaterials": "必要に応じて授業内で紹介する。",
  "schedulePlan": "第1週: 前期の復習および後期の目標 第2週: Unit 6 未来の建築 (居住環境の優先順位) 第3週: Unit 6 未来の建築 (メリット・デメリット) 第4週:&nbsp;&nbsp;Unit 7 宇宙探査 (未来予測と可能性) 第5週: Unit 7 宇宙探査 (旅行計画) 第6週: Unit 8 芸術 (多様性と価値観) 第7週: 復習、学修理解度の確認 第8週: Presentation Skillsを学ぶ 第9週: Unit 9 自然環境 (自然と都市) 第10週: Unit 10 コミュニケーション(手段・スタイル) 第11週: Presentation Skillsの練習 第12週: Unit 10 コミュニケーション(種類・方法) 第13週: Presentation 発表 (1) 第14週: Presentation 発表 (2) 第15週: 学期末の復習、到達目標の振り返り"
}