{
  "subjectName": "専門スキル演習(インフォメーションデザイン)",
  "instructors": [
    "小川遥介(兼任講師)"
  ],
  "courseCategory": "専門教育科目",
  "courseType": "演習科目",
  "timetableCode": "S3130",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "火",
      "period": 1
    },
    {
      "day": "火",
      "period": 2
    }
  ],
  "department": [
    "デザイン学部デザイン学科視覚デザイン専攻"
  ],
  "grade": [
    3,
    4
  ],
  "credits": 2,
  "classroom": "３１１１６デザインクリエーションルーム３",
  "lastUpdated": "2025/03/16",
  "overview": "複雑で量の多い情報を簡潔に分かりやすく整理して視覚化していくインフォグラフィックスのデザインの習得を目的に、分析・評価能力を養い、問題解決の手法としてインフォクグラフィックスのコンテンツ制作を行う。 美しい図解の描き方、データビジュアライゼーションの表現方法に加え、レイアウト、フォント、情報の編集などの知識とスキルを学ぶ。 また、制作したインフォグラフィックスをWEBサイト、スマートフォンアプリ、プレゼンテーションなど様々な形式へ流用可能なデータの取り扱い方についての知識を学ぶ。 Adobe Illustrator と Figma を使用して実学に基づく専門能力を養い、実践的でより最適化されたデータを操作できるスキルを身につける。 また、作品発表を通してコミュニケーション能力も身につける。 この授業は「視覚情報デザインコース専門演習III」の授業の内容と連携している。 使用するソフトウェア： - Adobe Illustrator - Figma (www.figma.com/)",
  "objectives": "それぞれの課題を通して下記の項目を到達目標としている。 ① 効率的な制作作業と時間管理 ② 美しいインフォグラフィックスのデザイン（人の目を引く、伝えたい情報を明確にする、必要な情報を簡潔化する、目の流れを考える） ③ グリッドを理解した分かりやすいレイアウト ④ コンテンツに基づいた情報の編集、構造化",
  "teachingMethod": "ノートPCを使用したデザイン制作が中心となる。 １限目にソフトウェアの操作方法を説明し、２限目にその操作方法を覚えるように個々の課題を行い授業は進行する。",
  "notes": "この授業は必要に応じてオンラインと対面授業の併用で行われる。 科目の内容上、「視覚情報デザインコース専門演習」とあわせて履修することが望ましい。",
  "preparation": "▼授業前 事前に配布している課題概要を読み理解し、素材の制作や取材、発表準備等の事前準備を行う。 ▼授業後は、 個人のスキルに合わせ、習得できなかったスキルを復習しマスターすること。 また、授業中に終わらなかった課題制作を行い、何ができて何ができなかったのか自分で振り返り、どのようにすれば改善できるのか考え、制作過程のリフレクションを行うこと。",
  "evaluation": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおり。 またラーニングアウトカムズの評価基準にも対応した詳細については学生ポータルを参照。 ① 制作段階【45%】（授業理解、丁寧な作業、期限内提出、集中度） ② 結果段階【45%】（課題理解、スキル・知識の理解、独自の発想、スキル・知識の応用、十分な作業量、提出期限、完成度） ③ プレゼンテーション段階【10%】（作品意図、的確な説明）",
  "textbook": "基本的に資料はオンラインで閲覧できるものとする。 （必要に応じて授業時にプリントを配布する）",
  "referenceMaterials": "▼2025年現在、書店で買えそうな本 「インフォグラフィック制作ガイド」櫻田 潤（BNN, 2024） ▼各自で見つけられたら購入を勧める本 「インフォグラフィックー情報をデザインする視点と表現」、木村 博之、2010、誠文堂新光社 「伝わるインフォグラフィックス」、リンクアップ、2014、グラフィック社 「文字のデザイン: ターゲットから発想する」 (視覚伝達ラボ・シリーズ) 、デザインノート編集部、2019、誠文堂新光社",
  "schedulePlan": "第1回 ：ガイダンス 第2回 ：Figmaの基本操作１ 第3回 ：Figmaの基本操作２ 第4回 ：課題① 情報の抽象化 第5回 ：課題① 情報の構造化 第6回 ：課題① パーツの作成 第7回 ：課題① 成果物プレゼンテーション 第8回 ：課題① 成果物の修正と提出 第9回 ：課題② 図解のインフォグラフィック 情報の整理・構造化 第10回&nbsp;&nbsp;&nbsp;：課題② アイソメ図法の図解 第11回&nbsp;&nbsp;&nbsp;：課題② レイアウト、素材のデザイン 第12回&nbsp;&nbsp;&nbsp;：課題③ フォントと文字 第13回&nbsp;&nbsp;&nbsp;：課題② サムネールデザイン 第14回&nbsp;&nbsp;&nbsp;：課題② 作品プレゼンテーション 第15回&nbsp;&nbsp;&nbsp;：総括、最終成果物の修正と提出"
}