{
  "subjectName": "専門スキル演習(サウンドデザイン)",
  "instructors": [
    "松村誠一郎(デザイン学部デザイン学科)"
  ],
  "courseCategory": "専門教育科目",
  "courseType": "演習科目",
  "timetableCode": "S3140",
  "semester": "2025年度 後期",
  "schedule": [
    {
      "day": "火",
      "period": 1
    },
    {
      "day": "火",
      "period": 2
    }
  ],
  "department": [
    "デザイン学部デザイン学科視覚デザイン専攻"
  ],
  "grade": [
    3,
    4
  ],
  "credits": 2,
  "classroom": "３１１１３教室",
  "lastUpdated": "2025/01/25",
  "overview": "現代の映像、ゲーム、Webといったの分野において、目には見えない音楽、音響、効果音といった「サウンド」の要素が時としてコンテンツ全体の方向性、空気感、世界観を左右する役割を果たす場面が少なくない。また、デジタルテクノロジーとインタラクションを用いたサウンドデザインは広告、メディアの分野で台頭してきている。本授業では、電子音楽を支えるデジタルサウンドテクノロジーの基礎知識と音に関するサウンドプログラミングについて実践的な制作作業を通して学ぶ。従来の音楽制作や音響ミキシングではなく、これからの社会に通用する新しい「サウンドデザイン」に必要なスキルを獲得していく。サウンドプログラミングにはノードベースのプログラミング環境のPure Data（以下、Pd）を用いる。これまでプログラミングツールは一部の専門的なプログラマーが使うためのものであったが、Pdは未経験者でも十分に習得が可能な音のプログラミングツールである。サウンドデザイン表現に基づいたコンテンツを完成させるプロセスを通して、先行事例を調査する等の「分析・評価能力」、サウンドプログラミングにおける「論理的な思考力」と「問題解決力」、そしてサウンドデザイン分野のコンテンツ制作での「実学に基づく専門能力」の養成を目指す。 本講義はゲーム制作企業におけるサウンドデザイン業務の実務経験を有した教員が行う実践的科目である。",
  "objectives": "・デジタルサウンドの基礎知識を理解する。 ・サウンドプログラミングを実践する。",
  "teachingMethod": "実践演習形式の授業。ノートPC必携。毎授業での小課題の提出に加えて、中間・期末課題を課す。",
  "notes": "・音楽制作経験の有無については問わない ・Webアクセス、インターネット検索、タッチタイピング等、基本的なコンピュータの操作に慣れていることを前提とする。 ・必携ノートPCとヘッドフォン（イヤホン）を毎回持参し、学内無線LANに接続して作業を行う。事前に学内無線LANへの接続の確認、本学の電子メールアカウント（edu.teu.ac.jp）へのログイン、そのeduアカウントのGoogleドライブの利用ができるようにしておくこと。。本学部の推奨ノートPCはMacだが、本授業で使用するソフトウェアはWindowsも可である ・演習には以下のソフトウェアを使用する。 -Pure Data http://www.puredata.info/ ・本授業では持参した各自のノートPCの好不調、OSの操作については関知しない。各自がノートPCのセットアップを事前に実施し、管理しておくこと。OSは最新版になっていることが望ましい。 ・前期の「サウンドデザイン論」を受講していることが望ましい。",
  "preparation": "・予習 授業資料を見て、実践して確認する。演習で使用するSonic Pi、Pdをダウンロード、起動、音の出力を確認しておくこと。授業資料の入手先は初回授業でリンク先を提示する。（目途：30分程度） ・復習 授業内容に関連する小課題を自宅で実践する。不明の用語はインターネット検索、参考文献などを参照して自主的に学修すること。（目途：30分程度）",
  "evaluation": "課題制作に取り組む各段階での評価項目により評価、点数化し、60点以上を単位認定要件とする。各段階での評価項目は下記のとおりである。 ①制作【45%】（授業理解、期限内提出による授業参加度）②結果【45%】（課題理解、スキル・知識の理解、独自の発想、スキル・知識の応用、十分な作業量、提出期限、完成度）③プレゼンテーション段階【10%】（作品意図、的確な説明）",
  "textbook": "松村誠一郎著,Pd Recipe Book Pure Dataではじめるサウンドプログラミング,BNN新社,2012年（電子書籍版） 松村誠一郎他著,メディアテクノロジーシリーズ8 サウンドデザイン, コロナ社, 2024年.",
  "referenceMaterials": "授業内で適宜指示する。",
  "schedulePlan": "第1回：ガイダンス 第2回：サウンドプログラミングの基礎 1 第3回：サウンドプログラミングの基礎 2 第4回：サウンドプログラミングの基礎 3 第5回：サウンドプログラミングの基礎 4 第6回：サウンドプログラミングの基礎 5 第7回：中間発表 第8回：サウンドプログラミングの応用1 第9回：サウンドプログラミングの応用2 第10回：サウンドプログラミングの応用3 第11回：サウンドプログラミングの応用4 第12回：サウンドプログラミングの応用5 第13回：制作作業 第14回：期末発表 第15回：まとめ"
}