{
  "subjectName": "解剖学実習I",
  "instructors": [
    "阿部達彦(医療保健学部リハビリテーション学科作業療法学専攻)"
  ],
  "courseCategory": "専門基礎科目",
  "courseType": "実習科目",
  "timetableCode": "U6016",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "木",
      "period": 4
    },
    {
      "day": "木",
      "period": 5
    }
  ],
  "department": [
    "医療保健学部"
  ],
  "grade": [
    1,
    2,
    3,
    4
  ],
  "credits": 1,
  "classroom": "Ｍ４０５基礎医学実習室 , Ｍ４０７生物・化学実習室",
  "lastUpdated": "2025/01/26",
  "overview": "解剖学実習Ⅰでは内臓学と循環器学を中心に学ぶ。解剖学は医療を専門とする者にとって不可欠な勉強で、内容も多岐にわたっている。皆さんが対象とする患者さんの健康を考える時に、人の正常な姿や人体の構造を隅々まで理解しておく必要がある。医療人としての原点となる最も基本的な解剖学を勉強する。",
  "objectives": "人体の形態学的な構造のうち、特に内臓系、脈管系、神経系の基本的な構造を理解し、将来的に勉強するであろう臨床科目のバックグラウンドとなる基礎知識を確立する。本科目は人体に対する論理的な思考力を修得できる。",
  "teachingMethod": "基本的に教科書の内容に準拠した講義と実習を行う。学生は内容毎に講義を受講し、これを定着させるための実習で課題に取り組み、これを提出しなければならない。また、本年度はアクティブラーニングの一環として、グループによる討議―発表という形式の実習も適宜行う。",
  "notes": "講義については、通常の講義と同様に教科書や参考資料を中心とした予・復習を行う必要がある。この予・復習が実習課題の予習にもなっているので、おろそかにしないでほしい。 なお、スケッチの目的は臓器や器官系の特徴を理解することであり、美しいスケッチを目指す必要はない。「形はどのようであるか」、「大きさは？」、「形が楕円形であるならば縦と横ではどちらが大きいのか」、「器官の集まり方などに法則性はあるのか」などと詳細に調べ上げていくのが観察であり、スケッチはその記録にすぎない。スケッチしきれないことを言葉で記載することを所見といい、教科書的な知識をコピー＆ペーストすることではない。観察の成否はスケッチ・スキル以前の問題である。",
  "preparation": "教科書等を複数あたって予習することを勧める。既習と思われる内容でも様々な教科書や論文等で勉強を深める癖をつけること。インターネットで安易に調べても良いが、出典先によっては引用を認めないこともあるので、予め成書等で調査しておく必要があります。 また、実習時にも教科書や参考書は必携すること。",
  "evaluation": "講義60％、実習40％で評価し、100点満点中、60点以上で単位認定とする。 加点要件 講義は中間試験および期末試験で通常のペーパーテストを行い、それらの正答率をそれぞれ30点満点に換算する。実習は課題レポートの内容で評価を行い総合して40点満点に換算する。これらを合算し、100点満点中、60点以上で単位認定とする。 加点要件 課題の内容評価",
  "textbook": "分冊解剖学アトラスⅡ 第6版 内臓 Helga Fritsch(著)、‎Wolfgang Kühnel(著)、平田 幸男（訳）文光堂",
  "referenceMaterials": "人体解剖学 改訂第42版 藤田恒太郎著 南江堂 標準理学療法学・作業療法学 解剖学 第５版 野村 嶬編集 医学書院 阿波清五郎の解剖学語呂合わせ 鹿野俊一著 理工図書 プロメテウス解剖学 エッセンシャルテキスト (第2版) 監訳：中野 隆 医学書院 他の参考図書については個別に相談すること。",
  "schedulePlan": "第1回 講義 人体の構造 ／ 消化器系①消化管１ 第2回 講義 消化器系②消化管2 ／ 実習①消化管 第3回 講義 消化器系③消化腺 ／ 呼吸器系①上気道 第4回 講義 呼吸器系②下気道 ／ 実習②消化腺と呼吸器 第5回 講義 筋総論 ／ 循環器①血管と心臓、胎児循環、小循環 第6回 講義 循環器②動脈1大動脈 ／ 実習③心臓と血管 第7回 講義 循環器④静脈1門脈系・皮静脈 ／ 循環器⑤静脈2奇静脈とリンパ 第8回 中間試験 ／ 解 説 第9回 講義 循環器③動脈2四肢の動脈 ／ 実習④四肢の血管について討議 第10回 講義 循環器④静脈3四肢の静脈 ／ 実習④’四肢の血管について発表 第11回 講義 泌尿器①尿路 ／ 泌尿器②腎 第12回 講義 男性生殖器 精路・精巣・外性器 ／ 女性生殖器 卵巣・子宮・骨盤底筋 第13回 実習⑤泌尿器・生殖器 ／ 講義 内分泌①総論と下垂体・視床下部 第14回 講義 内分泌②甲状腺と副甲状腺 ／ 内分泌③副腎他 第15回 実習⑥内分泌 ／ 講義 まとめ"
}