{
  "subjectName": "微生物検査学実習II",
  "instructors": [
    "岡崎充宏(医療保健学部臨床検査学科)"
  ],
  "courseCategory": "専門科目",
  "courseType": "実習科目",
  "timetableCode": "W5304",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "月",
      "period": 3
    },
    {
      "day": "月",
      "period": 4
    },
    {
      "day": "月",
      "period": 5
    },
    {
      "day": "火",
      "period": 3
    },
    {
      "day": "火",
      "period": 4
    },
    {
      "day": "火",
      "period": 5
    },
    {
      "day": "水",
      "period": 3
    },
    {
      "day": "水",
      "period": 4
    },
    {
      "day": "水",
      "period": 5
    },
    {
      "day": "木",
      "period": 3
    },
    {
      "day": "木",
      "period": 4
    },
    {
      "day": "木",
      "period": 5
    }
  ],
  "department": [
    "医療保健学部"
  ],
  "grade": [
    3,
    4
  ],
  "credits": 2,
  "classroom": "Ｍ３０１臨床検査実習室２ , Ｍ３０２臨床検査実習室３",
  "lastUpdated": "2025/01/17",
  "overview": "微生物学実習では，講義で得られた知識をフルに活用し，実際に生きている細菌を用いて，細菌の菌種名および薬剤感受性検査を行う．その過程において自身の知識の乏しい項目の再確認を兼ねて，改めて理解を深めるとともに，それに関連する領域分野の検査や研究の基礎として，将来，更なる向上心が芽生えることを切望する． この科目は，実務経験を有する専門職が，その経験に基づいた講義を行う実践的科目である．",
  "objectives": "実習において実際の検査室で求められる知識・技術を取得し、実学に基づく専門能力および分析・評価能力を養い臨地実習先で十分に活用できることを目標とする．",
  "teachingMethod": "実際に病原性が低いと考えられている各種の菌を用いて実習を行う．使用機器は，光学顕微鏡，遠心機，ガスバーナー，高圧滅菌器，乾熱滅菌器，白金耳，白金線，各種培地など実際の現場で使用する機器や道具を用いて行う．その際に，適正な個人防護具の着用の仕方を習得する．",
  "notes": "教員の指示に従い細菌を取り扱う．微生物検査の日常業務において頻繁に使用される細菌の菌種名および菌の生物化学的特徴や病原因子などの専門用語を覚え，理解できるように努める．",
  "preparation": "（予習） 実習内容に関する配布資料や教科書の該当箇所を読んでくる (90分） （復習） 配布資料や教科書など，実習全体について復習する (90分）",
  "evaluation": "成績は，口頭試問（80％），授業態度（5％），筆記テスト（15％）を総合的に考慮して判断する．特に，実習に使用するテキストに，漏れなく実習の経過や結果を記入することは必要であり、3年次後期の臨地実習で役立つ。",
  "textbook": "最新臨床検査講座 臨床微生物学 （医歯薬出版）",
  "referenceMaterials": "臨床微生物学検査ハンドブック 第5版 三輪書店 感染症レジデントマニュアル 医学書院 レジデントのための感染症診療ﾏﾆｭｱﾙ 第2版 医学書院 戸田新細菌学 南山堂",
  "schedulePlan": "第1回：好気性または通性嫌気性Gram陽性ブドウ球菌の同定と感染症 第2回：好気性または通性嫌気性Gram陽性レンサ球菌の同定と感染症，検体採取法（咽頭拭い液） 第3回：Gram陰性球菌およびGram陰性球桿菌の同定と感染症 第4回：Gram陰性，通性嫌気性桿菌（腸内細菌）の同定と感染症，検体採取法（便の採取その他） 第5回：Gram陰性，通性嫌気性桿菌（腸内細菌以外）の同定と感染症 第6回：Gram陰性，好気性桿菌の同定と感染症 第7回：Gram陰性，微好気性らせん桿菌の同定と感染症 第8回：Gram陽性，好気性桿菌の同定と感染症 第9回：Gram陽性，抗酸性桿菌の同定と感染症 第10回：偏性嫌気性菌の同定と感染症 第11回：スピロヘータ科/レプトスピラ科の同定と感染症 第12回：マイコプラズマ/リケッチア/クラミジアの同定と感染症 第13回：ウイルス学，検体採取法（鼻腔拭い液） 第14回：病原真菌学，検体採取法（皮膚表在組織病変部） 第15回：感染制御学，検体採取法（鼻腔吸引液）"
}