{
  "subjectName": "言語発達障害学II",
  "instructors": [
    "池田泰子(医療保健学部リハビリテーション学科言語聴覚学専攻)"
  ],
  "courseCategory": "専門科目",
  "courseType": "演習科目",
  "timetableCode": "W63206",
  "semester": "2025年度 前期",
  "schedule": [
    {
      "day": "金",
      "period": 4
    },
    {
      "day": "金",
      "period": 5
    }
  ],
  "department": [
    "医療保健学部"
  ],
  "grade": [
    2,
    3,
    4
  ],
  "credits": 2,
  "classroom": "３１９１１発声発語検査室",
  "lastUpdated": "2025/01/20",
  "overview": "子どもの評価結果から訓練の方針を立案するため、評価結果は子どもを良い方向に支援するための重要な根拠となります。評価の1つとして検査があり、子どもを対象とした検査は数多くあるため、各検査の特徴を理解していなければ子どもの状態に合った検査を選択することはできません。本科目では、「言語発達学」「発達心理学」で学んだ知識を基に、言語発達障害児に対して適切な評価を行うために必須となる検査の知識と技術を学び、実学に基づく専門能力を学修します。また、演習を通して実施方法、採点方法、結果の解釈等を学修します。この科目は、実務経験を有する専門職がその経験に基づいた講義を行う実践的科目です。",
  "objectives": "1．主要な検査の特徴を説明できる 2. マニュアル通りに検査を実施できる 4．マニュアルに従って正しく採点できる 5. 検査結果を正しく算出することができる",
  "teachingMethod": "・教科書、配布資料、スライドを用いてシラバスに沿って講義を進めます。シラバスの授業計画に変更が生じた場合は、その都度説明します。 ・講義で得られた情報を基に自身の考えを記述するリアクションペーパーを毎回課します。 ・講義資料はムードルにアップするとともに、こちらで印刷し、配布します。 ・ノートPCは必携ではありません。使用する場合は事前にアナウンスします。 ・第1回から10回までは、数人で1つの検査用具を使用するグループ演習を行います。 ・第14回は、検査の特徴を調べてまとめるグループワークを実施し、第15回にその発表を行います。",
  "notes": "※関連科目：（1年前期）言語発達学 （2年前期）言語発達障害学Ⅰ （2年後期）言語発達障害学Ⅲ、、小児科学 ・リアクションペーパーは、提出期限より後に提出されたものは受け取りません。また、授業に欠席した人の提出は認めません。",
  "preparation": "・シラバスに示されている授業計画を確認し、教科書の該当部分を読んで予習を行ってください（30分） ・授業における学びを振り返り、理解を深めることを目的として、毎授業後にリアクションペーパーの提出を課します（20分） ・復習状況を確認するために小テストを実施します。小テストの実施については、授業時にアナウンスします（30分）。",
  "evaluation": "定期試験：60％、小テスト：30％、毎回のリアクションペーパー：10％ リアクションペーパーは下記の基準で評価を行います。 【A】自分の考えを根拠とともに過不足のない形で明確に記述（5点） 【B】自分の考えと根拠との関連が認められるが、一部明確でない形で記述（3点） 【C】根拠を踏まえた記述ではない（1点） 【D】期日までに未提出（0点）",
  "textbook": "・標準言語聴覚障害学 言語発達障害学 第3版:深浦順一・藤野博・石坂郁代編、医学書院、2021年 ・国リハ式＜S-S法＞言語発達遅滞検査マニュアル第4版:小寺富子他、エスコアール、1998年",
  "referenceMaterials": "・クリア言語聴覚療法4 言語発達障害：内山千鶴子・後藤多可志編著、建帛社、2024年 ・標準言語聴覚障害学 言語聴覚療法 評価・診断学:深浦順一・植田恵編、医学書院、2020年 ・最新言語聴覚学講座 言語発達障害学:石坂郁代・水戸陽子編著、医歯薬出版、2023年",
  "schedulePlan": "第1回：オリエンテーション、検査の種類、検査実施の注意点 第2回：演習 絵画語い発達検査 PVT-R 第3回：演習 WISC-Ⅴ（1）検査の特徴、記録 第4回：演習 WISC-Ⅴ（2）検査実施準備 第5回：演習 WISC-Ⅴ（3）模擬ケース1 検査 第6回：演習 WISC-Ⅴ（4）模擬ケース2 結果のまとめ 第7回：演習 国リハ式＜S-S法＞言語発達検査（1） 検査の特徴、記録 第8回：演習 国リハ式＜S-S法＞言語発達検査（2） 検査演習の準備 第9回：演習 国リハ式＜S-S法＞言語発達検査（3） 模擬ケース1 検査 第10回：演習 国リハ式＜S-S法＞言語発達検査（4） 模擬ケース2 評価のまとめ 第11回：グループワーク：その他の検査① 第12回：発表：その他の検査② 第13回：講義 田中ビネー知能検査 V 第14回：講義 新版K式発達検査2020 第15回：講義 KABC-II、まとめ"
}